GNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-64.el7
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /w/fac.2/cs/eggert/bin64/bin/emacs-24.5...done.
(gdb) Breakpoint 1 at 0x5438c0: file ../../emacs-24.5/src/data.c, line 2767.
(gdb) (gdb) Starting program: /u/cs/fac/eggert/bin64/bin/emacs-24.5 -batch -eval \(print\ \(\*\ 6997\ -4398042316799\ 179\)\)
gobject.pyc: gdb was not built with custom backtrace support, disabling.
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib64/libthread_db.so.1".
[New Thread 0x7fffe3e00700 (LWP 5296)]

Breakpoint 1, Ftimes (nargs=3, args=0x7fffffffd820) at ../../emacs-24.5/src/data.c:2767
2767	{
=> 0x00000000005438c0 <Ftimes+0>:	48 89 f2	mov    %rsi,%rdx
Missing separate debuginfos, use: debuginfo-install alsa-lib-1.0.28-2.el7.x86_64 at-spi2-atk-2.8.1-4.el7.x86_64 at-spi2-core-2.8.0-6.el7.x86_64 atk-2.8.0-4.el7.x86_64 cairo-1.12.14-6.el7.x86_64 cairo-gobject-1.12.14-6.el7.x86_64 dbus-libs-1.6.12-11.el7.x86_64 expat-2.1.0-8.el7.x86_64 fontconfig-2.10.95-7.el7.x86_64 freetype-2.4.11-10.el7_1.1.x86_64 gdk-pixbuf2-2.28.2-5.el7_1.x86_64 glib2-2.40.0-4.el7.x86_64 glibc-2.17-78.el7.x86_64 gmp-6.0.0-11.el7.x86_64 gnutls-3.3.8-12.el7_1.1.x86_64 gtk3-3.8.8-10.el7.x86_64 harfbuzz-0.9.20-4.el7.x86_64 jbigkit-libs-2.0-11.el7.x86_64 keyutils-libs-1.5.8-3.el7.x86_64 krb5-libs-1.12.2-14.el7.x86_64 libICE-1.0.8-7.el7.x86_64 libSM-1.2.1-7.el7.x86_64 libX11-1.6.0-2.1.el7.x86_64 libXau-1.0.8-2.1.el7.x86_64 libXcomposite-0.4.4-4.1.el7.x86_64 libXcursor-1.1.14-2.1.el7.x86_64 libXdamage-1.1.4-4.1.el7.x86_64 libXext-1.3.2-2.1.el7.x86_64 libXfixes-5.0.1-2.1.el7.x86_64 libXft-2.3.1-5.1.el7.x86_64 libXi-1.7.2-2.1.el7.x86_64 libXinerama-1.1.3-2.1.el7.x86_64 libXpm-3.5.10-5.1.el7.x86_64 libXrandr-1.4.1-2.1.el7.x86_64 libXrender-0.9.8-2.1.el7.x86_64 libXxf86vm-1.1.3-2.1.el7.x86_64 libacl-2.2.51-12.el7.x86_64 libattr-2.4.46-12.el7.x86_64 libcom_err-1.42.9-7.el7.x86_64 libcroco-0.6.8-5.el7.x86_64 libdrm-2.4.56-2.el7.x86_64 libffi-3.0.13-11.el7.x86_64 libgcc-4.8.3-9.el7.x86_64 libjpeg-turbo-1.2.90-5.el7.x86_64 libpng-1.5.13-5.el7.x86_64 librsvg2-2.39.0-1.el7.x86_64 libselinux-2.2.2-6.el7.x86_64 libtasn1-3.8-2.el7.x86_64 libtiff-4.0.3-14.el7.x86_64 libuuid-2.23.2-22.el7_1.1.x86_64 libxcb-1.9-5.el7.x86_64 libxml2-2.9.1-5.el7_1.2.x86_64 mesa-libEGL-10.2.7-5.20140910.el7_1.1.x86_64 mesa-libGL-10.2.7-5.20140910.el7_1.1.x86_64 mesa-libgbm-10.2.7-5.20140910.el7_1.1.x86_64 mesa-libglapi-10.2.7-5.20140910.el7_1.1.x86_64 ncurses-libs-5.9-13.20130511.el7.x86_64 nettle-2.7.1-4.el7.x86_64 openssl-libs-1.0.1e-42.el7_1.9.x86_64 p11-kit-0.20.7-3.el7.x86_64 pango-1.34.1-5.el7.x86_64 pcre-8.32-14.el7.x86_64 pixman-0.32.4-3.el7.x86_64 trousers-0.3.11.2-4.el7_1.x86_64 xz-libs-5.1.2-9alpha.el7.x86_64 zlib-1.2.7-13.el7.x86_64
(gdb) 2768	  return arith_driver (Amult, nargs, args);
=> 0x00000000005438c3 <Ftimes+3>:	48 89 fe	mov    %rdi,%rsi
   0x00000000005438c6 <Ftimes+6>:	bf 02 00 00 00	mov    $0x2,%edi
   0x00000000005438cb <Ftimes+11>:	e9 30 fc ff ff	jmpq   0x543500 <arith_driver>
(gdb) Line 2768 of "../../emacs-24.5/src/data.c" starts at address 0x5438c3 <Ftimes+3>
   and ends at 0x5438d0 <Fmax>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x7fffffffd820	140737488345120
rdi            0x3	3
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd818	0x7fffffffd818
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x5438c3	0x5438c3 <Ftimes+3>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005438c6	2768	  return arith_driver (Amult, nargs, args);
   0x00000000005438c3 <Ftimes+3>:	48 89 fe	mov    %rdi,%rsi
=> 0x00000000005438c6 <Ftimes+6>:	bf 02 00 00 00	mov    $0x2,%edi
   0x00000000005438cb <Ftimes+11>:	e9 30 fc ff ff	jmpq   0x543500 <arith_driver>
(gdb) Line 2768 of "../../emacs-24.5/src/data.c" starts at address 0x5438c3 <Ftimes+3>
   and ends at 0x5438d0 <Fmax>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x3	3
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd818	0x7fffffffd818
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x5438c6	0x5438c6 <Ftimes+6>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005438cb	2768	  return arith_driver (Amult, nargs, args);
   0x00000000005438c3 <Ftimes+3>:	48 89 fe	mov    %rdi,%rsi
   0x00000000005438c6 <Ftimes+6>:	bf 02 00 00 00	mov    $0x2,%edi
=> 0x00000000005438cb <Ftimes+11>:	e9 30 fc ff ff	jmpq   0x543500 <arith_driver>
(gdb) Line 2768 of "../../emacs-24.5/src/data.c" starts at address 0x5438c3 <Ftimes+3>
   and ends at 0x5438d0 <Fmax>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd818	0x7fffffffd818
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x5438cb	0x5438cb <Ftimes+11>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) arith_driver (code=Amult, nargs=3, args=0x7fffffffd820) at ../../emacs-24.5/src/data.c:2577
2577	{
=> 0x0000000000543500 <arith_driver+0>:	41 57	push   %r15
   0x0000000000543502 <arith_driver+2>:	41 56	push   %r14
   0x0000000000543504 <arith_driver+4>:	41 55	push   %r13
   0x0000000000543506 <arith_driver+6>:	41 54	push   %r12
   0x0000000000543508 <arith_driver+8>:	55	push   %rbp
   0x0000000000543509 <arith_driver+9>:	53	push   %rbx
   0x000000000054350a <arith_driver+10>:	bd 01 00 00 00	mov    $0x1,%ebp
   0x000000000054350f <arith_driver+15>:	48 83 ec 18	sub    $0x18,%rsp
(gdb) Line 2577 of "../../emacs-24.5/src/data.c" starts at address 0x543500 <arith_driver>
   and ends at 0x543513 <arith_driver+19>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd818	0x7fffffffd818
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x543500	0x543500 <arith_driver>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543502	2577	{
   0x0000000000543500 <arith_driver+0>:	41 57	push   %r15
=> 0x0000000000543502 <arith_driver+2>:	41 56	push   %r14
   0x0000000000543504 <arith_driver+4>:	41 55	push   %r13
   0x0000000000543506 <arith_driver+6>:	41 54	push   %r12
   0x0000000000543508 <arith_driver+8>:	55	push   %rbp
   0x0000000000543509 <arith_driver+9>:	53	push   %rbx
   0x000000000054350a <arith_driver+10>:	bd 01 00 00 00	mov    $0x1,%ebp
   0x000000000054350f <arith_driver+15>:	48 83 ec 18	sub    $0x18,%rsp
(gdb) Line 2577 of "../../emacs-24.5/src/data.c" starts at address 0x543500 <arith_driver>
   and ends at 0x543513 <arith_driver+19>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd810	0x7fffffffd810
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x543502	0x543502 <arith_driver+2>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543504	2577	{
   0x0000000000543500 <arith_driver+0>:	41 57	push   %r15
   0x0000000000543502 <arith_driver+2>:	41 56	push   %r14
=> 0x0000000000543504 <arith_driver+4>:	41 55	push   %r13
   0x0000000000543506 <arith_driver+6>:	41 54	push   %r12
   0x0000000000543508 <arith_driver+8>:	55	push   %rbp
   0x0000000000543509 <arith_driver+9>:	53	push   %rbx
   0x000000000054350a <arith_driver+10>:	bd 01 00 00 00	mov    $0x1,%ebp
   0x000000000054350f <arith_driver+15>:	48 83 ec 18	sub    $0x18,%rsp
(gdb) Line 2577 of "../../emacs-24.5/src/data.c" starts at address 0x543500 <arith_driver>
   and ends at 0x543513 <arith_driver+19>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd808	0x7fffffffd808
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x543504	0x543504 <arith_driver+4>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543506	2577	{
   0x0000000000543500 <arith_driver+0>:	41 57	push   %r15
   0x0000000000543502 <arith_driver+2>:	41 56	push   %r14
   0x0000000000543504 <arith_driver+4>:	41 55	push   %r13
=> 0x0000000000543506 <arith_driver+6>:	41 54	push   %r12
   0x0000000000543508 <arith_driver+8>:	55	push   %rbp
   0x0000000000543509 <arith_driver+9>:	53	push   %rbx
   0x000000000054350a <arith_driver+10>:	bd 01 00 00 00	mov    $0x1,%ebp
   0x000000000054350f <arith_driver+15>:	48 83 ec 18	sub    $0x18,%rsp
(gdb) Line 2577 of "../../emacs-24.5/src/data.c" starts at address 0x543500 <arith_driver>
   and ends at 0x543513 <arith_driver+19>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd800	0x7fffffffd800
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x543506	0x543506 <arith_driver+6>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543508	2577	{
   0x0000000000543500 <arith_driver+0>:	41 57	push   %r15
   0x0000000000543502 <arith_driver+2>:	41 56	push   %r14
   0x0000000000543504 <arith_driver+4>:	41 55	push   %r13
   0x0000000000543506 <arith_driver+6>:	41 54	push   %r12
=> 0x0000000000543508 <arith_driver+8>:	55	push   %rbp
   0x0000000000543509 <arith_driver+9>:	53	push   %rbx
   0x000000000054350a <arith_driver+10>:	bd 01 00 00 00	mov    $0x1,%ebp
   0x000000000054350f <arith_driver+15>:	48 83 ec 18	sub    $0x18,%rsp
(gdb) Line 2577 of "../../emacs-24.5/src/data.c" starts at address 0x543500 <arith_driver>
   and ends at 0x543513 <arith_driver+19>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd7f8	0x7fffffffd7f8
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x543508	0x543508 <arith_driver+8>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543509	2577	{
   0x0000000000543500 <arith_driver+0>:	41 57	push   %r15
   0x0000000000543502 <arith_driver+2>:	41 56	push   %r14
   0x0000000000543504 <arith_driver+4>:	41 55	push   %r13
   0x0000000000543506 <arith_driver+6>:	41 54	push   %r12
   0x0000000000543508 <arith_driver+8>:	55	push   %rbp
=> 0x0000000000543509 <arith_driver+9>:	53	push   %rbx
   0x000000000054350a <arith_driver+10>:	bd 01 00 00 00	mov    $0x1,%ebp
   0x000000000054350f <arith_driver+15>:	48 83 ec 18	sub    $0x18,%rsp
(gdb) Line 2577 of "../../emacs-24.5/src/data.c" starts at address 0x543500 <arith_driver>
   and ends at 0x543513 <arith_driver+19>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd7f0	0x7fffffffd7f0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x543509	0x543509 <arith_driver+9>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054350a	2577	{
   0x0000000000543500 <arith_driver+0>:	41 57	push   %r15
   0x0000000000543502 <arith_driver+2>:	41 56	push   %r14
   0x0000000000543504 <arith_driver+4>:	41 55	push   %r13
   0x0000000000543506 <arith_driver+6>:	41 54	push   %r12
   0x0000000000543508 <arith_driver+8>:	55	push   %rbp
   0x0000000000543509 <arith_driver+9>:	53	push   %rbx
=> 0x000000000054350a <arith_driver+10>:	bd 01 00 00 00	mov    $0x1,%ebp
   0x000000000054350f <arith_driver+15>:	48 83 ec 18	sub    $0x18,%rsp
(gdb) Line 2577 of "../../emacs-24.5/src/data.c" starts at address 0x543500 <arith_driver>
   and ends at 0x543513 <arith_driver+19>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd7e8	0x7fffffffd7e8
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x54350a	0x54350a <arith_driver+10>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054350f	2577	{
   0x0000000000543500 <arith_driver+0>:	41 57	push   %r15
   0x0000000000543502 <arith_driver+2>:	41 56	push   %r14
   0x0000000000543504 <arith_driver+4>:	41 55	push   %r13
   0x0000000000543506 <arith_driver+6>:	41 54	push   %r12
   0x0000000000543508 <arith_driver+8>:	55	push   %rbp
   0x0000000000543509 <arith_driver+9>:	53	push   %rbx
   0x000000000054350a <arith_driver+10>:	bd 01 00 00 00	mov    $0x1,%ebp
=> 0x000000000054350f <arith_driver+15>:	48 83 ec 18	sub    $0x18,%rsp
(gdb) Line 2577 of "../../emacs-24.5/src/data.c" starts at address 0x543500 <arith_driver>
   and ends at 0x543513 <arith_driver+19>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7e8	0x7fffffffd7e8
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x54350f	0x54350f <arith_driver+15>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2584	  switch (code)
=> 0x0000000000543513 <arith_driver+19>:	83 ff 02	cmp    $0x2,%edi
   0x0000000000543516 <arith_driver+22>:	74 0d	je     0x543525 <arith_driver+37>
(gdb) Line 2584 of "../../emacs-24.5/src/data.c" starts at address 0x543513 <arith_driver+19>
   and ends at 0x543518 <arith_driver+24>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x543513	0x543513 <arith_driver+19>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543516	2584	  switch (code)
   0x0000000000543513 <arith_driver+19>:	83 ff 02	cmp    $0x2,%edi
=> 0x0000000000543516 <arith_driver+22>:	74 0d	je     0x543525 <arith_driver+37>
(gdb) Line 2584 of "../../emacs-24.5/src/data.c" starts at address 0x543513 <arith_driver+19>
   and ends at 0x543518 <arith_driver+24>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x543516	0x543516 <arith_driver+22>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2602	  for (argnum = 0; argnum < nargs; argnum++)
=> 0x0000000000543525 <arith_driver+37>:	48 85 f6	test   %rsi,%rsi
   0x0000000000543528 <arith_driver+40>:	0f 8e 7d 01 00 00	jle    0x5436ab <arith_driver+427>
   0x000000000054352e <arith_driver+46>:	49 89 d7	mov    %rdx,%r15
   0x0000000000543531 <arith_driver+49>:	49 89 f5	mov    %rsi,%r13
   0x0000000000543534 <arith_driver+52>:	41 89 fe	mov    %edi,%r14d
   0x0000000000543537 <arith_driver+55>:	49 89 eb	mov    %rbp,%r11
   0x000000000054353a <arith_driver+58>:	31 c9	xor    %ecx,%ecx
   0x000000000054353c <arith_driver+60>:	31 db	xor    %ebx,%ebx
   0x000000000054353e <arith_driver+62>:	45 31 e4	xor    %r12d,%r12d
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x543525	0x543525 <arith_driver+37>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543528	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x0000000000543525 <arith_driver+37>:	48 85 f6	test   %rsi,%rsi
=> 0x0000000000543528 <arith_driver+40>:	0f 8e 7d 01 00 00	jle    0x5436ab <arith_driver+427>
   0x000000000054352e <arith_driver+46>:	49 89 d7	mov    %rdx,%r15
   0x0000000000543531 <arith_driver+49>:	49 89 f5	mov    %rsi,%r13
   0x0000000000543534 <arith_driver+52>:	41 89 fe	mov    %edi,%r14d
   0x0000000000543537 <arith_driver+55>:	49 89 eb	mov    %rbp,%r11
   0x000000000054353a <arith_driver+58>:	31 c9	xor    %ecx,%ecx
   0x000000000054353c <arith_driver+60>:	31 db	xor    %ebx,%ebx
   0x000000000054353e <arith_driver+62>:	45 31 e4	xor    %r12d,%r12d
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x543528	0x543528 <arith_driver+40>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054352e	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x0000000000543525 <arith_driver+37>:	48 85 f6	test   %rsi,%rsi
   0x0000000000543528 <arith_driver+40>:	0f 8e 7d 01 00 00	jle    0x5436ab <arith_driver+427>
=> 0x000000000054352e <arith_driver+46>:	49 89 d7	mov    %rdx,%r15
   0x0000000000543531 <arith_driver+49>:	49 89 f5	mov    %rsi,%r13
   0x0000000000543534 <arith_driver+52>:	41 89 fe	mov    %edi,%r14d
   0x0000000000543537 <arith_driver+55>:	49 89 eb	mov    %rbp,%r11
   0x000000000054353a <arith_driver+58>:	31 c9	xor    %ecx,%ecx
   0x000000000054353c <arith_driver+60>:	31 db	xor    %ebx,%ebx
   0x000000000054353e <arith_driver+62>:	45 31 e4	xor    %r12d,%r12d
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x54352e	0x54352e <arith_driver+46>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543531	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x0000000000543525 <arith_driver+37>:	48 85 f6	test   %rsi,%rsi
   0x0000000000543528 <arith_driver+40>:	0f 8e 7d 01 00 00	jle    0x5436ab <arith_driver+427>
   0x000000000054352e <arith_driver+46>:	49 89 d7	mov    %rdx,%r15
=> 0x0000000000543531 <arith_driver+49>:	49 89 f5	mov    %rsi,%r13
   0x0000000000543534 <arith_driver+52>:	41 89 fe	mov    %edi,%r14d
   0x0000000000543537 <arith_driver+55>:	49 89 eb	mov    %rbp,%r11
   0x000000000054353a <arith_driver+58>:	31 c9	xor    %ecx,%ecx
   0x000000000054353c <arith_driver+60>:	31 db	xor    %ebx,%ebx
   0x000000000054353e <arith_driver+62>:	45 31 e4	xor    %r12d,%r12d
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0x7fffffffd820	140737488345120
rip            0x543531	0x543531 <arith_driver+49>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543534	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x0000000000543525 <arith_driver+37>:	48 85 f6	test   %rsi,%rsi
   0x0000000000543528 <arith_driver+40>:	0f 8e 7d 01 00 00	jle    0x5436ab <arith_driver+427>
   0x000000000054352e <arith_driver+46>:	49 89 d7	mov    %rdx,%r15
   0x0000000000543531 <arith_driver+49>:	49 89 f5	mov    %rsi,%r13
=> 0x0000000000543534 <arith_driver+52>:	41 89 fe	mov    %edi,%r14d
   0x0000000000543537 <arith_driver+55>:	49 89 eb	mov    %rbp,%r11
   0x000000000054353a <arith_driver+58>:	31 c9	xor    %ecx,%ecx
   0x000000000054353c <arith_driver+60>:	31 db	xor    %ebx,%ebx
   0x000000000054353e <arith_driver+62>:	45 31 e4	xor    %r12d,%r12d
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x3	3
r14            0x7fffffffd820	140737488345120
r15            0x7fffffffd820	140737488345120
rip            0x543534	0x543534 <arith_driver+52>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543537	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x0000000000543525 <arith_driver+37>:	48 85 f6	test   %rsi,%rsi
   0x0000000000543528 <arith_driver+40>:	0f 8e 7d 01 00 00	jle    0x5436ab <arith_driver+427>
   0x000000000054352e <arith_driver+46>:	49 89 d7	mov    %rdx,%r15
   0x0000000000543531 <arith_driver+49>:	49 89 f5	mov    %rsi,%r13
   0x0000000000543534 <arith_driver+52>:	41 89 fe	mov    %edi,%r14d
=> 0x0000000000543537 <arith_driver+55>:	49 89 eb	mov    %rbp,%r11
   0x000000000054353a <arith_driver+58>:	31 c9	xor    %ecx,%ecx
   0x000000000054353c <arith_driver+60>:	31 db	xor    %ebx,%ebx
   0x000000000054353e <arith_driver+62>:	45 31 e4	xor    %r12d,%r12d
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x7ffff2068b70	140737253903216
r12            0xafa950	11512144
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543537	0x543537 <arith_driver+55>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054353a	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x0000000000543525 <arith_driver+37>:	48 85 f6	test   %rsi,%rsi
   0x0000000000543528 <arith_driver+40>:	0f 8e 7d 01 00 00	jle    0x5436ab <arith_driver+427>
   0x000000000054352e <arith_driver+46>:	49 89 d7	mov    %rdx,%r15
   0x0000000000543531 <arith_driver+49>:	49 89 f5	mov    %rsi,%r13
   0x0000000000543534 <arith_driver+52>:	41 89 fe	mov    %edi,%r14d
   0x0000000000543537 <arith_driver+55>:	49 89 eb	mov    %rbp,%r11
=> 0x000000000054353a <arith_driver+58>:	31 c9	xor    %ecx,%ecx
   0x000000000054353c <arith_driver+60>:	31 db	xor    %ebx,%ebx
   0x000000000054353e <arith_driver+62>:	45 31 e4	xor    %r12d,%r12d
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x400000000a000000	4611686018595160064
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0xafa950	11512144
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54353a	0x54353a <arith_driver+58>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054353c	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x0000000000543525 <arith_driver+37>:	48 85 f6	test   %rsi,%rsi
   0x0000000000543528 <arith_driver+40>:	0f 8e 7d 01 00 00	jle    0x5436ab <arith_driver+427>
   0x000000000054352e <arith_driver+46>:	49 89 d7	mov    %rdx,%r15
   0x0000000000543531 <arith_driver+49>:	49 89 f5	mov    %rsi,%r13
   0x0000000000543534 <arith_driver+52>:	41 89 fe	mov    %edi,%r14d
   0x0000000000543537 <arith_driver+55>:	49 89 eb	mov    %rbp,%r11
   0x000000000054353a <arith_driver+58>:	31 c9	xor    %ecx,%ecx
=> 0x000000000054353c <arith_driver+60>:	31 db	xor    %ebx,%ebx
   0x000000000054353e <arith_driver+62>:	45 31 e4	xor    %r12d,%r12d
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0xf1d440	15848512
rbx            0x7fffffffd838	140737488345144
rcx            0x0	0
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0xafa950	11512144
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54353c	0x54353c <arith_driver+60>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054353e	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x0000000000543525 <arith_driver+37>:	48 85 f6	test   %rsi,%rsi
   0x0000000000543528 <arith_driver+40>:	0f 8e 7d 01 00 00	jle    0x5436ab <arith_driver+427>
   0x000000000054352e <arith_driver+46>:	49 89 d7	mov    %rdx,%r15
   0x0000000000543531 <arith_driver+49>:	49 89 f5	mov    %rsi,%r13
   0x0000000000543534 <arith_driver+52>:	41 89 fe	mov    %edi,%r14d
   0x0000000000543537 <arith_driver+55>:	49 89 eb	mov    %rbp,%r11
   0x000000000054353a <arith_driver+58>:	31 c9	xor    %ecx,%ecx
   0x000000000054353c <arith_driver+60>:	31 db	xor    %ebx,%ebx
=> 0x000000000054353e <arith_driver+62>:	45 31 e4	xor    %r12d,%r12d
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0xf1d440	15848512
rbx            0x0	0
rcx            0x0	0
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0xafa950	11512144
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54353e	0x54353e <arith_driver+62>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2611	      val = args[argnum];
=> 0x0000000000543541 <arith_driver+65>:	49 8b 3c df	mov    (%r15,%rbx,8),%rdi
(gdb) Line 2611 of "../../emacs-24.5/src/data.c" starts at address 0x543541 <arith_driver+65>
   and ends at 0x543545 <arith_driver+69>.
(gdb) rax            0xf1d440	15848512
rbx            0x0	0
rcx            0x0	0
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x2	2
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543541	0x543541 <arith_driver+65>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) XTYPE (a=27988) at ../../emacs-24.5/src/lisp.h:703
703	LISP_MACRO_DEFUN (XTYPE, enum Lisp_Type, (Lisp_Object a), (a))
=> 0x0000000000543545 <arith_driver+69>:	89 f8	mov    %edi,%eax
   0x0000000000543547 <arith_driver+71>:	89 fe	mov    %edi,%esi
   0x0000000000543549 <arith_driver+73>:	83 e0 07	and    $0x7,%eax
(gdb) Line 703 of "../../emacs-24.5/src/lisp.h" starts at address 0x541c80 <Farrayp>
   and ends at 0x541c85 <Farrayp+5>.
(gdb) rax            0xf1d440	15848512
rbx            0x0	0
rcx            0x0	0
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543545	0x543545 <arith_driver+69>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543547	703	LISP_MACRO_DEFUN (XTYPE, enum Lisp_Type, (Lisp_Object a), (a))
   0x0000000000543545 <arith_driver+69>:	89 f8	mov    %edi,%eax
=> 0x0000000000543547 <arith_driver+71>:	89 fe	mov    %edi,%esi
   0x0000000000543549 <arith_driver+73>:	83 e0 07	and    $0x7,%eax
(gdb) Line 703 of "../../emacs-24.5/src/lisp.h" starts at address 0x541c80 <Farrayp>
   and ends at 0x541c85 <Farrayp+5>.
(gdb) rax            0x6d54	27988
rbx            0x0	0
rcx            0x0	0
rdx            0x7fffffffd820	140737488345120
rsi            0x3	3
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543547	0x543547 <arith_driver+71>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543549	703	LISP_MACRO_DEFUN (XTYPE, enum Lisp_Type, (Lisp_Object a), (a))
   0x0000000000543545 <arith_driver+69>:	89 f8	mov    %edi,%eax
   0x0000000000543547 <arith_driver+71>:	89 fe	mov    %edi,%esi
=> 0x0000000000543549 <arith_driver+73>:	83 e0 07	and    $0x7,%eax
(gdb) Line 703 of "../../emacs-24.5/src/lisp.h" starts at address 0x541c80 <Farrayp>
   and ends at 0x541c85 <Farrayp+5>.
(gdb) rax            0x6d54	27988
rbx            0x0	0
rcx            0x0	0
rdx            0x7fffffffd820	140737488345120
rsi            0x6d54	27988
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543549	0x543549 <arith_driver+73>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) MARKERP (x=27988) at ../../emacs-24.5/src/lisp.h:2384
2384	LISP_MACRO_DEFUN (MARKERP, bool, (Lisp_Object x), (x))
=> 0x000000000054354c <arith_driver+76>:	83 f8 03	cmp    $0x3,%eax
   0x000000000054354f <arith_driver+79>:	74 7e	je     0x5435cf <arith_driver+207>
   0x0000000000543551 <arith_driver+81>:	0f 1f 80 00 00 00 00	nopl   0x0(%rax)
(gdb) Line 2384 of "../../emacs-24.5/src/lisp.h" starts at address 0x541d80 <Fmarkerp>
   and ends at 0x541d8a <Fmarkerp+10>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0x7fffffffd820	140737488345120
rsi            0x6d54	27988
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54354c	0x54354c <arith_driver+76>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054354f	2384	LISP_MACRO_DEFUN (MARKERP, bool, (Lisp_Object x), (x))
   0x000000000054354c <arith_driver+76>:	83 f8 03	cmp    $0x3,%eax
=> 0x000000000054354f <arith_driver+79>:	74 7e	je     0x5435cf <arith_driver+207>
   0x0000000000543551 <arith_driver+81>:	0f 1f 80 00 00 00 00	nopl   0x0(%rax)
(gdb) Line 2384 of "../../emacs-24.5/src/lisp.h" starts at address 0x541d80 <Fmarkerp>
   and ends at 0x541d8a <Fmarkerp+10>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0x7fffffffd820	140737488345120
rsi            0x6d54	27988
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54354f	0x54354f <arith_driver+79>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543551	2384	LISP_MACRO_DEFUN (MARKERP, bool, (Lisp_Object x), (x))
   0x000000000054354c <arith_driver+76>:	83 f8 03	cmp    $0x3,%eax
   0x000000000054354f <arith_driver+79>:	74 7e	je     0x5435cf <arith_driver+207>
=> 0x0000000000543551 <arith_driver+81>:	0f 1f 80 00 00 00 00	nopl   0x0(%rax)
(gdb) Line 2384 of "../../emacs-24.5/src/lisp.h" starts at address 0x541d80 <Fmarkerp>
   and ends at 0x541d8a <Fmarkerp+10>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0x7fffffffd820	140737488345120
rsi            0x6d54	27988
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543551	0x543551 <arith_driver+81>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) arith_driver (code=Amult, nargs=3, args=0x7fffffffd820) at ../../emacs-24.5/src/data.c:2612
2612	      CHECK_NUMBER_OR_FLOAT_COERCE_MARKER (val);
=> 0x0000000000543558 <arith_driver+88>:	40 f6 c7 03	test   $0x3,%dil
   0x000000000054355c <arith_driver+92>:	48 8b 15 35 4b 63 00	mov    0x634b35(%rip),%rdx        # 0xb78098 <Qnumber_or_marker_p>
   0x0000000000543563 <arith_driver+99>:	74 09	je     0x54356e <arith_driver+110>
   0x0000000000543565 <arith_driver+101>:	83 f8 07	cmp    $0x7,%eax
   0x0000000000543568 <arith_driver+104>:	0f 85 82 00 00 00	jne    0x5435f0 <arith_driver+240>
(gdb) Line 2612 of "../../emacs-24.5/src/data.c" starts at address 0x543558 <arith_driver+88>
   and ends at 0x54356e <arith_driver+110>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0x7fffffffd820	140737488345120
rsi            0x6d54	27988
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543558	0x543558 <arith_driver+88>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054355c	2612	      CHECK_NUMBER_OR_FLOAT_COERCE_MARKER (val);
   0x0000000000543558 <arith_driver+88>:	40 f6 c7 03	test   $0x3,%dil
=> 0x000000000054355c <arith_driver+92>:	48 8b 15 35 4b 63 00	mov    0x634b35(%rip),%rdx        # 0xb78098 <Qnumber_or_marker_p>
   0x0000000000543563 <arith_driver+99>:	74 09	je     0x54356e <arith_driver+110>
   0x0000000000543565 <arith_driver+101>:	83 f8 07	cmp    $0x7,%eax
   0x0000000000543568 <arith_driver+104>:	0f 85 82 00 00 00	jne    0x5435f0 <arith_driver+240>
(gdb) Line 2612 of "../../emacs-24.5/src/data.c" starts at address 0x543558 <arith_driver+88>
   and ends at 0x54356e <arith_driver+110>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0x7fffffffd820	140737488345120
rsi            0x6d54	27988
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54355c	0x54355c <arith_driver+92>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543563	2612	      CHECK_NUMBER_OR_FLOAT_COERCE_MARKER (val);
   0x0000000000543558 <arith_driver+88>:	40 f6 c7 03	test   $0x3,%dil
   0x000000000054355c <arith_driver+92>:	48 8b 15 35 4b 63 00	mov    0x634b35(%rip),%rdx        # 0xb78098 <Qnumber_or_marker_p>
=> 0x0000000000543563 <arith_driver+99>:	74 09	je     0x54356e <arith_driver+110>
   0x0000000000543565 <arith_driver+101>:	83 f8 07	cmp    $0x7,%eax
   0x0000000000543568 <arith_driver+104>:	0f 85 82 00 00 00	jne    0x5435f0 <arith_driver+240>
(gdb) Line 2612 of "../../emacs-24.5/src/data.c" starts at address 0x543558 <arith_driver+88>
   and ends at 0x54356e <arith_driver+110>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543563	0x543563 <arith_driver+99>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2614	      if (FLOATP (val))
=> 0x000000000054356e <arith_driver+110>:	83 f8 07	cmp    $0x7,%eax
   0x0000000000543571 <arith_driver+113>:	0f 84 25 02 00 00	je     0x54379c <arith_driver+668>
(gdb) Line 2614 of "../../emacs-24.5/src/data.c" starts at address 0x54356e <arith_driver+110>
   and ends at 0x543577 <arith_driver+119>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54356e	0x54356e <arith_driver+110>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543571	2614	      if (FLOATP (val))
   0x000000000054356e <arith_driver+110>:	83 f8 07	cmp    $0x7,%eax
=> 0x0000000000543571 <arith_driver+113>:	0f 84 25 02 00 00	je     0x54379c <arith_driver+668>
(gdb) Line 2614 of "../../emacs-24.5/src/data.c" starts at address 0x54356e <arith_driver+110>
   and ends at 0x543577 <arith_driver+119>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543571	0x543571 <arith_driver+113>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2617	      args[argnum] = val;
=> 0x0000000000543577 <arith_driver+119>:	49 89 3c df	mov    %rdi,(%r15,%rbx,8)
(gdb) Line 2617 of "../../emacs-24.5/src/data.c" starts at address 0x543577 <arith_driver+119>
   and ends at 0x54357b <arith_driver+123>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543577	0x543577 <arith_driver+119>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) XINT (a=27988) at ../../emacs-24.5/src/lisp.h:701
701	LISP_MACRO_DEFUN (XINT, EMACS_INT, (Lisp_Object a), (a))
=> 0x000000000054357b <arith_driver+123>:	48 c1 ff 02	sar    $0x2,%rdi
(gdb) Line 701 of "../../emacs-24.5/src/lisp.h" starts at address 0x542417 <Fash+23>
   and ends at 0x54241a <Fash+26>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x6d54	27988
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54357b	0x54357b <arith_driver+123>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) arith_driver (code=Amult, nargs=3, args=0x7fffffffd820) at ../../emacs-24.5/src/data.c:2619
2619	      switch (code)
=> 0x000000000054357f <arith_driver+127>:	41 83 fe 08	cmp    $0x8,%r14d
   0x0000000000543583 <arith_driver+131>:	77 23	ja     0x5435a8 <arith_driver+168>
   0x0000000000543585 <arith_driver+133>:	44 89 f0	mov    %r14d,%eax
   0x0000000000543588 <arith_driver+136>:	ff 24 c5 a0 c2 5e 00	jmpq   *0x5ec2a0(,%rax,8)
   0x000000000054358f <arith_driver+143>:	90	nop
(gdb) Line 2619 of "../../emacs-24.5/src/data.c" starts at address 0x54357f <arith_driver+127>
   and ends at 0x543590 <arith_driver+144>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54357f	0x54357f <arith_driver+127>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543583	2619	      switch (code)
   0x000000000054357f <arith_driver+127>:	41 83 fe 08	cmp    $0x8,%r14d
=> 0x0000000000543583 <arith_driver+131>:	77 23	ja     0x5435a8 <arith_driver+168>
   0x0000000000543585 <arith_driver+133>:	44 89 f0	mov    %r14d,%eax
   0x0000000000543588 <arith_driver+136>:	ff 24 c5 a0 c2 5e 00	jmpq   *0x5ec2a0(,%rax,8)
   0x000000000054358f <arith_driver+143>:	90	nop
(gdb) Line 2619 of "../../emacs-24.5/src/data.c" starts at address 0x54357f <arith_driver+127>
   and ends at 0x543590 <arith_driver+144>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543583	0x543583 <arith_driver+131>
eflags         0x297	[ CF PF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543585	2619	      switch (code)
   0x000000000054357f <arith_driver+127>:	41 83 fe 08	cmp    $0x8,%r14d
   0x0000000000543583 <arith_driver+131>:	77 23	ja     0x5435a8 <arith_driver+168>
=> 0x0000000000543585 <arith_driver+133>:	44 89 f0	mov    %r14d,%eax
   0x0000000000543588 <arith_driver+136>:	ff 24 c5 a0 c2 5e 00	jmpq   *0x5ec2a0(,%rax,8)
   0x000000000054358f <arith_driver+143>:	90	nop
(gdb) Line 2619 of "../../emacs-24.5/src/data.c" starts at address 0x54357f <arith_driver+127>
   and ends at 0x543590 <arith_driver+144>.
(gdb) rax            0x4	4
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543585	0x543585 <arith_driver+133>
eflags         0x297	[ CF PF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543588	2619	      switch (code)
   0x000000000054357f <arith_driver+127>:	41 83 fe 08	cmp    $0x8,%r14d
   0x0000000000543583 <arith_driver+131>:	77 23	ja     0x5435a8 <arith_driver+168>
   0x0000000000543585 <arith_driver+133>:	44 89 f0	mov    %r14d,%eax
=> 0x0000000000543588 <arith_driver+136>:	ff 24 c5 a0 c2 5e 00	jmpq   *0x5ec2a0(,%rax,8)
   0x000000000054358f <arith_driver+143>:	90	nop
(gdb) Line 2619 of "../../emacs-24.5/src/data.c" starts at address 0x54357f <arith_driver+127>
   and ends at 0x543590 <arith_driver+144>.
(gdb) rax            0x2	2
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543588	0x543588 <arith_driver+136>
eflags         0x297	[ CF PF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
=> 0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543600	0x543600 <arith_driver+256>
eflags         0x297	[ CF PF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543603	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
=> 0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543603	0x543603 <arith_driver+259>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543609	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
=> 0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543609	0x543609 <arith_driver+265>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054360f	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
=> 0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54360f	0x54360f <arith_driver+271>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543612	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
=> 0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543612	0x543612 <arith_driver+274>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543618	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
=> 0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543618	0x543618 <arith_driver+280>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543622	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
=> 0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x7fffffffffffffff	9223372036854775807
rbx            0x0	0
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543622	0x543622 <arith_driver+290>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543624	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
=> 0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x7fffffffffffffff	9223372036854775807
rbx            0x0	0
rcx            0x0	0
rdx            0x0	0
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543624	0x543624 <arith_driver+292>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543627	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
=> 0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x4aee2e9caa7ef	1318189515057135
rbx            0x0	0
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543627	0x543627 <arith_driver+295>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054362a	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
=> 0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x4aee2e9caa7ef	1318189515057135
rbx            0x0	0
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54362a	0x54362a <arith_driver+298>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054362d	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
=> 0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x4aee2e9caa700	1318189515056896
rbx            0x0	0
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54362d	0x54362d <arith_driver+301>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054362f	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
=> 0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x4aee2e9caa700	1318189515056896
rbx            0x0	0
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54362f	0x54362f <arith_driver+303>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2645		    accum *= next;
=> 0x00000000005437c8 <arith_driver+712>:	48 0f af ef	imul   %rdi,%rbp
   0x00000000005437cc <arith_driver+716>:	e9 d7 fd ff ff	jmpq   0x5435a8 <arith_driver+168>
   0x00000000005437d1 <arith_driver+721>:	0f 1f 80 00 00 00 00	nopl   0x0(%rax)
(gdb) Line 2645 of "../../emacs-24.5/src/data.c" starts at address 0x5437c8 <arith_driver+712>
   and ends at 0x5437d8 <arith_driver+728>.
(gdb) rax            0x4aee2e9caa700	1318189515056896
rbx            0x0	0
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1	0x1
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437c8	0x5437c8 <arith_driver+712>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005437cc	2645		    accum *= next;
   0x00000000005437c8 <arith_driver+712>:	48 0f af ef	imul   %rdi,%rbp
=> 0x00000000005437cc <arith_driver+716>:	e9 d7 fd ff ff	jmpq   0x5435a8 <arith_driver+168>
   0x00000000005437d1 <arith_driver+721>:	0f 1f 80 00 00 00 00	nopl   0x0(%rax)
(gdb) Line 2645 of "../../emacs-24.5/src/data.c" starts at address 0x5437c8 <arith_driver+712>
   and ends at 0x5437d8 <arith_driver+728>.
(gdb) rax            0x4aee2e9caa700	1318189515056896
rbx            0x0	0
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437cc	0x5437cc <arith_driver+716>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2602	  for (argnum = 0; argnum < nargs; argnum++)
=> 0x00000000005435a8 <arith_driver+168>:	48 83 c3 01	add    $0x1,%rbx
   0x00000000005435ac <arith_driver+172>:	49 39 dd	cmp    %rbx,%r13
   0x00000000005435af <arith_driver+175>:	0f 84 f6 00 00 00	je     0x5436ab <arith_driver+427>
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0x4aee2e9caa700	1318189515056896
rbx            0x0	0
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435a8	0x5435a8 <arith_driver+168>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435ac	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x00000000005435a8 <arith_driver+168>:	48 83 c3 01	add    $0x1,%rbx
=> 0x00000000005435ac <arith_driver+172>:	49 39 dd	cmp    %rbx,%r13
   0x00000000005435af <arith_driver+175>:	0f 84 f6 00 00 00	je     0x5436ab <arith_driver+427>
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0x4aee2e9caa700	1318189515056896
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435ac	0x5435ac <arith_driver+172>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435af	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x00000000005435a8 <arith_driver+168>:	48 83 c3 01	add    $0x1,%rbx
   0x00000000005435ac <arith_driver+172>:	49 39 dd	cmp    %rbx,%r13
=> 0x00000000005435af <arith_driver+175>:	0f 84 f6 00 00 00	je     0x5436ab <arith_driver+427>
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0x4aee2e9caa700	1318189515056896
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435af	0x5435af <arith_driver+175>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2611	      val = args[argnum];
=> 0x00000000005435b5 <arith_driver+181>:	49 8b 3c df	mov    (%r15,%rbx,8),%rdi
   0x00000000005435b9 <arith_driver+185>:	84 c9	test   %cl,%cl
   0x00000000005435bb <arith_driver+187>:	4c 0f 44 dd	cmove  %rbp,%r11
   0x00000000005435bf <arith_driver+191>:	4c 0f 44 e3	cmove  %rbx,%r12
(gdb) Line 2611 of "../../emacs-24.5/src/data.c" starts at address 0x543541 <arith_driver+65>
   and ends at 0x543545 <arith_driver+69>.
(gdb) rax            0x4aee2e9caa700	1318189515056896
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0x1b55	6997
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435b5	0x5435b5 <arith_driver+181>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435b9	2611	      val = args[argnum];
   0x00000000005435b5 <arith_driver+181>:	49 8b 3c df	mov    (%r15,%rbx,8),%rdi
=> 0x00000000005435b9 <arith_driver+185>:	84 c9	test   %cl,%cl
   0x00000000005435bb <arith_driver+187>:	4c 0f 44 dd	cmove  %rbp,%r11
   0x00000000005435bf <arith_driver+191>:	4c 0f 44 e3	cmove  %rbx,%r12
(gdb) Line 2611 of "../../emacs-24.5/src/data.c" starts at address 0x543541 <arith_driver+65>
   and ends at 0x543545 <arith_driver+69>.
(gdb) rax            0x4aee2e9caa700	1318189515056896
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435b9	0x5435b9 <arith_driver+185>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435bb	2611	      val = args[argnum];
   0x00000000005435b5 <arith_driver+181>:	49 8b 3c df	mov    (%r15,%rbx,8),%rdi
   0x00000000005435b9 <arith_driver+185>:	84 c9	test   %cl,%cl
=> 0x00000000005435bb <arith_driver+187>:	4c 0f 44 dd	cmove  %rbp,%r11
   0x00000000005435bf <arith_driver+191>:	4c 0f 44 e3	cmove  %rbx,%r12
(gdb) Line 2611 of "../../emacs-24.5/src/data.c" starts at address 0x543541 <arith_driver+65>
   and ends at 0x543545 <arith_driver+69>.
(gdb) rax            0x4aee2e9caa700	1318189515056896
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1	1
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435bb	0x5435bb <arith_driver+187>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435bf	2611	      val = args[argnum];
   0x00000000005435b5 <arith_driver+181>:	49 8b 3c df	mov    (%r15,%rbx,8),%rdi
   0x00000000005435b9 <arith_driver+185>:	84 c9	test   %cl,%cl
   0x00000000005435bb <arith_driver+187>:	4c 0f 44 dd	cmove  %rbp,%r11
=> 0x00000000005435bf <arith_driver+191>:	4c 0f 44 e3	cmove  %rbx,%r12
(gdb) Line 2611 of "../../emacs-24.5/src/data.c" starts at address 0x543541 <arith_driver+65>
   and ends at 0x543545 <arith_driver+69>.
(gdb) rax            0x4aee2e9caa700	1318189515056896
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x0	0
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435bf	0x5435bf <arith_driver+191>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) XTYPE (a=-17592169267196) at ../../emacs-24.5/src/lisp.h:703
703	LISP_MACRO_DEFUN (XTYPE, enum Lisp_Type, (Lisp_Object a), (a))
=> 0x00000000005435c3 <arith_driver+195>:	89 f8	mov    %edi,%eax
   0x00000000005435c5 <arith_driver+197>:	89 fe	mov    %edi,%esi
   0x00000000005435c7 <arith_driver+199>:	83 e0 07	and    $0x7,%eax
(gdb) Line 703 of "../../emacs-24.5/src/lisp.h" starts at address 0x541c80 <Farrayp>
   and ends at 0x541c85 <Farrayp+5>.
(gdb) rax            0x4aee2e9caa700	1318189515056896
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435c3	0x5435c3 <arith_driver+195>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435c5	703	LISP_MACRO_DEFUN (XTYPE, enum Lisp_Type, (Lisp_Object a), (a))
   0x00000000005435c3 <arith_driver+195>:	89 f8	mov    %edi,%eax
=> 0x00000000005435c5 <arith_driver+197>:	89 fe	mov    %edi,%esi
   0x00000000005435c7 <arith_driver+199>:	83 e0 07	and    $0x7,%eax
(gdb) Line 703 of "../../emacs-24.5/src/lisp.h" starts at address 0x541c80 <Farrayp>
   and ends at 0x541c85 <Farrayp+5>.
(gdb) rax            0x1000004	16777220
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x6d54	27988
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435c5	0x5435c5 <arith_driver+197>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435c7	703	LISP_MACRO_DEFUN (XTYPE, enum Lisp_Type, (Lisp_Object a), (a))
   0x00000000005435c3 <arith_driver+195>:	89 f8	mov    %edi,%eax
   0x00000000005435c5 <arith_driver+197>:	89 fe	mov    %edi,%esi
=> 0x00000000005435c7 <arith_driver+199>:	83 e0 07	and    $0x7,%eax
(gdb) Line 703 of "../../emacs-24.5/src/lisp.h" starts at address 0x541c80 <Farrayp>
   and ends at 0x541c85 <Farrayp+5>.
(gdb) rax            0x1000004	16777220
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x1000004	16777220
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435c7	0x5435c7 <arith_driver+199>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) MARKERP (x=-17592169267196) at ../../emacs-24.5/src/lisp.h:2384
2384	LISP_MACRO_DEFUN (MARKERP, bool, (Lisp_Object x), (x))
=> 0x00000000005435ca <arith_driver+202>:	83 f8 03	cmp    $0x3,%eax
   0x00000000005435cd <arith_driver+205>:	75 89	jne    0x543558 <arith_driver+88>
   0x00000000005435cf <arith_driver+207>:	66 81 7f fd ac 5e	cmpw   $0x5eac,-0x3(%rdi)
   0x00000000005435d5 <arith_driver+213>:	0f 84 95 01 00 00	je     0x543770 <arith_driver+624>
(gdb) Line 2384 of "../../emacs-24.5/src/lisp.h" starts at address 0x541d80 <Fmarkerp>
   and ends at 0x541d8a <Fmarkerp+10>.
(gdb) rax            0x4	4
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x1000004	16777220
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435ca	0x5435ca <arith_driver+202>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435cd	2384	LISP_MACRO_DEFUN (MARKERP, bool, (Lisp_Object x), (x))
   0x00000000005435ca <arith_driver+202>:	83 f8 03	cmp    $0x3,%eax
=> 0x00000000005435cd <arith_driver+205>:	75 89	jne    0x543558 <arith_driver+88>
   0x00000000005435cf <arith_driver+207>:	66 81 7f fd ac 5e	cmpw   $0x5eac,-0x3(%rdi)
   0x00000000005435d5 <arith_driver+213>:	0f 84 95 01 00 00	je     0x543770 <arith_driver+624>
(gdb) Line 2384 of "../../emacs-24.5/src/lisp.h" starts at address 0x541d80 <Fmarkerp>
   and ends at 0x541d8a <Fmarkerp+10>.
(gdb) rax            0x4	4
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x1000004	16777220
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435cd	0x5435cd <arith_driver+205>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) arith_driver (code=Amult, nargs=3, args=0x7fffffffd820) at ../../emacs-24.5/src/data.c:2612
2612	      CHECK_NUMBER_OR_FLOAT_COERCE_MARKER (val);
=> 0x0000000000543558 <arith_driver+88>:	40 f6 c7 03	test   $0x3,%dil
   0x000000000054355c <arith_driver+92>:	48 8b 15 35 4b 63 00	mov    0x634b35(%rip),%rdx        # 0xb78098 <Qnumber_or_marker_p>
   0x0000000000543563 <arith_driver+99>:	74 09	je     0x54356e <arith_driver+110>
   0x0000000000543565 <arith_driver+101>:	83 f8 07	cmp    $0x7,%eax
   0x0000000000543568 <arith_driver+104>:	0f 85 82 00 00 00	jne    0x5435f0 <arith_driver+240>
(gdb) Line 2612 of "../../emacs-24.5/src/data.c" starts at address 0x543558 <arith_driver+88>
   and ends at 0x54356e <arith_driver+110>.
(gdb) rax            0x4	4
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x1000004	16777220
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543558	0x543558 <arith_driver+88>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054355c	2612	      CHECK_NUMBER_OR_FLOAT_COERCE_MARKER (val);
   0x0000000000543558 <arith_driver+88>:	40 f6 c7 03	test   $0x3,%dil
=> 0x000000000054355c <arith_driver+92>:	48 8b 15 35 4b 63 00	mov    0x634b35(%rip),%rdx        # 0xb78098 <Qnumber_or_marker_p>
   0x0000000000543563 <arith_driver+99>:	74 09	je     0x54356e <arith_driver+110>
   0x0000000000543565 <arith_driver+101>:	83 f8 07	cmp    $0x7,%eax
   0x0000000000543568 <arith_driver+104>:	0f 85 82 00 00 00	jne    0x5435f0 <arith_driver+240>
(gdb) Line 2612 of "../../emacs-24.5/src/data.c" starts at address 0x543558 <arith_driver+88>
   and ends at 0x54356e <arith_driver+110>.
(gdb) rax            0x4	4
rbx            0x1	1
rcx            0x0	0
rdx            0x8a4	2212
rsi            0x1000004	16777220
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54355c	0x54355c <arith_driver+92>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543563	2612	      CHECK_NUMBER_OR_FLOAT_COERCE_MARKER (val);
   0x0000000000543558 <arith_driver+88>:	40 f6 c7 03	test   $0x3,%dil
   0x000000000054355c <arith_driver+92>:	48 8b 15 35 4b 63 00	mov    0x634b35(%rip),%rdx        # 0xb78098 <Qnumber_or_marker_p>
=> 0x0000000000543563 <arith_driver+99>:	74 09	je     0x54356e <arith_driver+110>
   0x0000000000543565 <arith_driver+101>:	83 f8 07	cmp    $0x7,%eax
   0x0000000000543568 <arith_driver+104>:	0f 85 82 00 00 00	jne    0x5435f0 <arith_driver+240>
(gdb) Line 2612 of "../../emacs-24.5/src/data.c" starts at address 0x543558 <arith_driver+88>
   and ends at 0x54356e <arith_driver+110>.
(gdb) rax            0x4	4
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543563	0x543563 <arith_driver+99>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2614	      if (FLOATP (val))
=> 0x000000000054356e <arith_driver+110>:	83 f8 07	cmp    $0x7,%eax
   0x0000000000543571 <arith_driver+113>:	0f 84 25 02 00 00	je     0x54379c <arith_driver+668>
(gdb) Line 2614 of "../../emacs-24.5/src/data.c" starts at address 0x54356e <arith_driver+110>
   and ends at 0x543577 <arith_driver+119>.
(gdb) rax            0x4	4
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54356e	0x54356e <arith_driver+110>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543571	2614	      if (FLOATP (val))
   0x000000000054356e <arith_driver+110>:	83 f8 07	cmp    $0x7,%eax
=> 0x0000000000543571 <arith_driver+113>:	0f 84 25 02 00 00	je     0x54379c <arith_driver+668>
(gdb) Line 2614 of "../../emacs-24.5/src/data.c" starts at address 0x54356e <arith_driver+110>
   and ends at 0x543577 <arith_driver+119>.
(gdb) rax            0x4	4
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543571	0x543571 <arith_driver+113>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2617	      args[argnum] = val;
=> 0x0000000000543577 <arith_driver+119>:	49 89 3c df	mov    %rdi,(%r15,%rbx,8)
(gdb) Line 2617 of "../../emacs-24.5/src/data.c" starts at address 0x543577 <arith_driver+119>
   and ends at 0x54357b <arith_driver+123>.
(gdb) rax            0x4	4
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543577	0x543577 <arith_driver+119>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) XINT (a=-17592169267196) at ../../emacs-24.5/src/lisp.h:701
701	LISP_MACRO_DEFUN (XINT, EMACS_INT, (Lisp_Object a), (a))
=> 0x000000000054357b <arith_driver+123>:	48 c1 ff 02	sar    $0x2,%rdi
(gdb) Line 701 of "../../emacs-24.5/src/lisp.h" starts at address 0x542417 <Fash+23>
   and ends at 0x54241a <Fash+26>.
(gdb) rax            0x4	4
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffff00001000004	-17592169267196
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54357b	0x54357b <arith_driver+123>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) arith_driver (code=Amult, nargs=3, args=0x7fffffffd820) at ../../emacs-24.5/src/data.c:2619
2619	      switch (code)
=> 0x000000000054357f <arith_driver+127>:	41 83 fe 08	cmp    $0x8,%r14d
   0x0000000000543583 <arith_driver+131>:	77 23	ja     0x5435a8 <arith_driver+168>
   0x0000000000543585 <arith_driver+133>:	44 89 f0	mov    %r14d,%eax
   0x0000000000543588 <arith_driver+136>:	ff 24 c5 a0 c2 5e 00	jmpq   *0x5ec2a0(,%rax,8)
   0x000000000054358f <arith_driver+143>:	90	nop
(gdb) Line 2619 of "../../emacs-24.5/src/data.c" starts at address 0x54357f <arith_driver+127>
   and ends at 0x543590 <arith_driver+144>.
(gdb) rax            0x4	4
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54357f	0x54357f <arith_driver+127>
eflags         0x282	[ SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543583	2619	      switch (code)
   0x000000000054357f <arith_driver+127>:	41 83 fe 08	cmp    $0x8,%r14d
=> 0x0000000000543583 <arith_driver+131>:	77 23	ja     0x5435a8 <arith_driver+168>
   0x0000000000543585 <arith_driver+133>:	44 89 f0	mov    %r14d,%eax
   0x0000000000543588 <arith_driver+136>:	ff 24 c5 a0 c2 5e 00	jmpq   *0x5ec2a0(,%rax,8)
   0x000000000054358f <arith_driver+143>:	90	nop
(gdb) Line 2619 of "../../emacs-24.5/src/data.c" starts at address 0x54357f <arith_driver+127>
   and ends at 0x543590 <arith_driver+144>.
(gdb) rax            0x4	4
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543583	0x543583 <arith_driver+131>
eflags         0x297	[ CF PF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543585	2619	      switch (code)
   0x000000000054357f <arith_driver+127>:	41 83 fe 08	cmp    $0x8,%r14d
   0x0000000000543583 <arith_driver+131>:	77 23	ja     0x5435a8 <arith_driver+168>
=> 0x0000000000543585 <arith_driver+133>:	44 89 f0	mov    %r14d,%eax
   0x0000000000543588 <arith_driver+136>:	ff 24 c5 a0 c2 5e 00	jmpq   *0x5ec2a0(,%rax,8)
   0x000000000054358f <arith_driver+143>:	90	nop
(gdb) Line 2619 of "../../emacs-24.5/src/data.c" starts at address 0x54357f <arith_driver+127>
   and ends at 0x543590 <arith_driver+144>.
(gdb) rax            0x4	4
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543585	0x543585 <arith_driver+133>
eflags         0x297	[ CF PF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543588	2619	      switch (code)
   0x000000000054357f <arith_driver+127>:	41 83 fe 08	cmp    $0x8,%r14d
   0x0000000000543583 <arith_driver+131>:	77 23	ja     0x5435a8 <arith_driver+168>
   0x0000000000543585 <arith_driver+133>:	44 89 f0	mov    %r14d,%eax
=> 0x0000000000543588 <arith_driver+136>:	ff 24 c5 a0 c2 5e 00	jmpq   *0x5ec2a0(,%rax,8)
   0x000000000054358f <arith_driver+143>:	90	nop
(gdb) Line 2619 of "../../emacs-24.5/src/data.c" starts at address 0x54357f <arith_driver+127>
   and ends at 0x543590 <arith_driver+144>.
(gdb) rax            0x2	2
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543588	0x543588 <arith_driver+136>
eflags         0x297	[ CF PF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
=> 0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543600	0x543600 <arith_driver+256>
eflags         0x297	[ CF PF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543603	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
=> 0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543603	0x543603 <arith_driver+259>
eflags         0x282	[ SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
=> 0x00000000005437d8 <arith_driver+728>:	48 85 ed	test   %rbp,%rbp
   0x00000000005437db <arith_driver+731>:	78 75	js     0x543852 <arith_driver+850>
   0x00000000005437dd <arith_driver+733>:	48 83 ff ff	cmp    $0xffffffffffffffff,%rdi
   0x00000000005437e1 <arith_driver+737>:	74 e5	je     0x5437c8 <arith_driver+712>
   0x00000000005437e3 <arith_driver+739>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x00000000005437ed <arith_driver+749>:	48 99	cqto
   0x00000000005437ef <arith_driver+751>:	48 f7 ff	idiv   %rdi
   0x00000000005437f2 <arith_driver+754>:	48 39 e8	cmp    %rbp,%rax
   0x00000000005437f5 <arith_driver+757>:	0f 9c c0	setl   %al
   0x00000000005437f8 <arith_driver+760>:	e9 30 fe ff ff	jmpq   0x54362d <arith_driver+301>
   0x00000000005437fd <arith_driver+765>:	0f 1f 00	nopl   (%rax)
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437d8	0x5437d8 <arith_driver+728>
eflags         0x282	[ SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005437db	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x00000000005437d8 <arith_driver+728>:	48 85 ed	test   %rbp,%rbp
=> 0x00000000005437db <arith_driver+731>:	78 75	js     0x543852 <arith_driver+850>
   0x00000000005437dd <arith_driver+733>:	48 83 ff ff	cmp    $0xffffffffffffffff,%rdi
   0x00000000005437e1 <arith_driver+737>:	74 e5	je     0x5437c8 <arith_driver+712>
   0x00000000005437e3 <arith_driver+739>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x00000000005437ed <arith_driver+749>:	48 99	cqto
   0x00000000005437ef <arith_driver+751>:	48 f7 ff	idiv   %rdi
   0x00000000005437f2 <arith_driver+754>:	48 39 e8	cmp    %rbp,%rax
   0x00000000005437f5 <arith_driver+757>:	0f 9c c0	setl   %al
   0x00000000005437f8 <arith_driver+760>:	e9 30 fe ff ff	jmpq   0x54362d <arith_driver+301>
   0x00000000005437fd <arith_driver+765>:	0f 1f 00	nopl   (%rax)
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437db	0x5437db <arith_driver+731>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005437dd	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x00000000005437d8 <arith_driver+728>:	48 85 ed	test   %rbp,%rbp
   0x00000000005437db <arith_driver+731>:	78 75	js     0x543852 <arith_driver+850>
=> 0x00000000005437dd <arith_driver+733>:	48 83 ff ff	cmp    $0xffffffffffffffff,%rdi
   0x00000000005437e1 <arith_driver+737>:	74 e5	je     0x5437c8 <arith_driver+712>
   0x00000000005437e3 <arith_driver+739>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x00000000005437ed <arith_driver+749>:	48 99	cqto
   0x00000000005437ef <arith_driver+751>:	48 f7 ff	idiv   %rdi
   0x00000000005437f2 <arith_driver+754>:	48 39 e8	cmp    %rbp,%rax
   0x00000000005437f5 <arith_driver+757>:	0f 9c c0	setl   %al
   0x00000000005437f8 <arith_driver+760>:	e9 30 fe ff ff	jmpq   0x54362d <arith_driver+301>
   0x00000000005437fd <arith_driver+765>:	0f 1f 00	nopl   (%rax)
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437dd	0x5437dd <arith_driver+733>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005437e1	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x00000000005437d8 <arith_driver+728>:	48 85 ed	test   %rbp,%rbp
   0x00000000005437db <arith_driver+731>:	78 75	js     0x543852 <arith_driver+850>
   0x00000000005437dd <arith_driver+733>:	48 83 ff ff	cmp    $0xffffffffffffffff,%rdi
=> 0x00000000005437e1 <arith_driver+737>:	74 e5	je     0x5437c8 <arith_driver+712>
   0x00000000005437e3 <arith_driver+739>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x00000000005437ed <arith_driver+749>:	48 99	cqto
   0x00000000005437ef <arith_driver+751>:	48 f7 ff	idiv   %rdi
   0x00000000005437f2 <arith_driver+754>:	48 39 e8	cmp    %rbp,%rax
   0x00000000005437f5 <arith_driver+757>:	0f 9c c0	setl   %al
   0x00000000005437f8 <arith_driver+760>:	e9 30 fe ff ff	jmpq   0x54362d <arith_driver+301>
   0x00000000005437fd <arith_driver+765>:	0f 1f 00	nopl   (%rax)
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437e1	0x5437e1 <arith_driver+737>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005437e3	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x00000000005437d8 <arith_driver+728>:	48 85 ed	test   %rbp,%rbp
   0x00000000005437db <arith_driver+731>:	78 75	js     0x543852 <arith_driver+850>
   0x00000000005437dd <arith_driver+733>:	48 83 ff ff	cmp    $0xffffffffffffffff,%rdi
   0x00000000005437e1 <arith_driver+737>:	74 e5	je     0x5437c8 <arith_driver+712>
=> 0x00000000005437e3 <arith_driver+739>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x00000000005437ed <arith_driver+749>:	48 99	cqto
   0x00000000005437ef <arith_driver+751>:	48 f7 ff	idiv   %rdi
   0x00000000005437f2 <arith_driver+754>:	48 39 e8	cmp    %rbp,%rax
   0x00000000005437f5 <arith_driver+757>:	0f 9c c0	setl   %al
   0x00000000005437f8 <arith_driver+760>:	e9 30 fe ff ff	jmpq   0x54362d <arith_driver+301>
   0x00000000005437fd <arith_driver+765>:	0f 1f 00	nopl   (%rax)
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437e3	0x5437e3 <arith_driver+739>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005437ed	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x00000000005437d8 <arith_driver+728>:	48 85 ed	test   %rbp,%rbp
   0x00000000005437db <arith_driver+731>:	78 75	js     0x543852 <arith_driver+850>
   0x00000000005437dd <arith_driver+733>:	48 83 ff ff	cmp    $0xffffffffffffffff,%rdi
   0x00000000005437e1 <arith_driver+737>:	74 e5	je     0x5437c8 <arith_driver+712>
   0x00000000005437e3 <arith_driver+739>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
=> 0x00000000005437ed <arith_driver+749>:	48 99	cqto
   0x00000000005437ef <arith_driver+751>:	48 f7 ff	idiv   %rdi
   0x00000000005437f2 <arith_driver+754>:	48 39 e8	cmp    %rbp,%rax
   0x00000000005437f5 <arith_driver+757>:	0f 9c c0	setl   %al
   0x00000000005437f8 <arith_driver+760>:	e9 30 fe ff ff	jmpq   0x54362d <arith_driver+301>
   0x00000000005437fd <arith_driver+765>:	0f 1f 00	nopl   (%rax)
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x8000000000000000	-9223372036854775808
rbx            0x1	1
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437ed	0x5437ed <arith_driver+749>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005437ef	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x00000000005437d8 <arith_driver+728>:	48 85 ed	test   %rbp,%rbp
   0x00000000005437db <arith_driver+731>:	78 75	js     0x543852 <arith_driver+850>
   0x00000000005437dd <arith_driver+733>:	48 83 ff ff	cmp    $0xffffffffffffffff,%rdi
   0x00000000005437e1 <arith_driver+737>:	74 e5	je     0x5437c8 <arith_driver+712>
   0x00000000005437e3 <arith_driver+739>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x00000000005437ed <arith_driver+749>:	48 99	cqto
=> 0x00000000005437ef <arith_driver+751>:	48 f7 ff	idiv   %rdi
   0x00000000005437f2 <arith_driver+754>:	48 39 e8	cmp    %rbp,%rax
   0x00000000005437f5 <arith_driver+757>:	0f 9c c0	setl   %al
   0x00000000005437f8 <arith_driver+760>:	e9 30 fe ff ff	jmpq   0x54362d <arith_driver+301>
   0x00000000005437fd <arith_driver+765>:	0f 1f 00	nopl   (%rax)
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x8000000000000000	-9223372036854775808
rbx            0x1	1
rcx            0x0	0
rdx            0xffffffffffffffff	-1
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437ef	0x5437ef <arith_driver+751>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005437f2	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x00000000005437d8 <arith_driver+728>:	48 85 ed	test   %rbp,%rbp
   0x00000000005437db <arith_driver+731>:	78 75	js     0x543852 <arith_driver+850>
   0x00000000005437dd <arith_driver+733>:	48 83 ff ff	cmp    $0xffffffffffffffff,%rdi
   0x00000000005437e1 <arith_driver+737>:	74 e5	je     0x5437c8 <arith_driver+712>
   0x00000000005437e3 <arith_driver+739>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x00000000005437ed <arith_driver+749>:	48 99	cqto
   0x00000000005437ef <arith_driver+751>:	48 f7 ff	idiv   %rdi
=> 0x00000000005437f2 <arith_driver+754>:	48 39 e8	cmp    %rbp,%rax
   0x00000000005437f5 <arith_driver+757>:	0f 9c c0	setl   %al
   0x00000000005437f8 <arith_driver+760>:	e9 30 fe ff ff	jmpq   0x54362d <arith_driver+301>
   0x00000000005437fd <arith_driver+765>:	0f 1f 00	nopl   (%rax)
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x200002	2097154
rbx            0x1	1
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437f2	0x5437f2 <arith_driver+754>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005437f5	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x00000000005437d8 <arith_driver+728>:	48 85 ed	test   %rbp,%rbp
   0x00000000005437db <arith_driver+731>:	78 75	js     0x543852 <arith_driver+850>
   0x00000000005437dd <arith_driver+733>:	48 83 ff ff	cmp    $0xffffffffffffffff,%rdi
   0x00000000005437e1 <arith_driver+737>:	74 e5	je     0x5437c8 <arith_driver+712>
   0x00000000005437e3 <arith_driver+739>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x00000000005437ed <arith_driver+749>:	48 99	cqto
   0x00000000005437ef <arith_driver+751>:	48 f7 ff	idiv   %rdi
   0x00000000005437f2 <arith_driver+754>:	48 39 e8	cmp    %rbp,%rax
=> 0x00000000005437f5 <arith_driver+757>:	0f 9c c0	setl   %al
   0x00000000005437f8 <arith_driver+760>:	e9 30 fe ff ff	jmpq   0x54362d <arith_driver+301>
   0x00000000005437fd <arith_driver+765>:	0f 1f 00	nopl   (%rax)
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x200002	2097154
rbx            0x1	1
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437f5	0x5437f5 <arith_driver+757>
eflags         0x212	[ AF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005437f8	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x00000000005437d8 <arith_driver+728>:	48 85 ed	test   %rbp,%rbp
   0x00000000005437db <arith_driver+731>:	78 75	js     0x543852 <arith_driver+850>
   0x00000000005437dd <arith_driver+733>:	48 83 ff ff	cmp    $0xffffffffffffffff,%rdi
   0x00000000005437e1 <arith_driver+737>:	74 e5	je     0x5437c8 <arith_driver+712>
   0x00000000005437e3 <arith_driver+739>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x00000000005437ed <arith_driver+749>:	48 99	cqto
   0x00000000005437ef <arith_driver+751>:	48 f7 ff	idiv   %rdi
   0x00000000005437f2 <arith_driver+754>:	48 39 e8	cmp    %rbp,%rax
   0x00000000005437f5 <arith_driver+757>:	0f 9c c0	setl   %al
=> 0x00000000005437f8 <arith_driver+760>:	e9 30 fe ff ff	jmpq   0x54362d <arith_driver+301>
   0x00000000005437fd <arith_driver+765>:	0f 1f 00	nopl   (%rax)
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x200000	2097152
rbx            0x1	1
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437f8	0x5437f8 <arith_driver+760>
eflags         0x212	[ AF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054362d	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
=> 0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x200000	2097152
rbx            0x1	1
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54362d	0x54362d <arith_driver+301>
eflags         0x212	[ AF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054362f	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
=> 0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x200000	2097152
rbx            0x1	1
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54362f	0x54362f <arith_driver+303>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2645		    accum *= next;
=> 0x00000000005437c8 <arith_driver+712>:	48 0f af ef	imul   %rdi,%rbp
   0x00000000005437cc <arith_driver+716>:	e9 d7 fd ff ff	jmpq   0x5435a8 <arith_driver+168>
   0x00000000005437d1 <arith_driver+721>:	0f 1f 80 00 00 00 00	nopl   0x0(%rax)
(gdb) Line 2645 of "../../emacs-24.5/src/data.c" starts at address 0x5437c8 <arith_driver+712>
   and ends at 0x5437d8 <arith_driver+728>.
(gdb) rax            0x200000	2097152
rbx            0x1	1
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0x1b55	0x1b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437c8	0x5437c8 <arith_driver+712>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005437cc	2645		    accum *= next;
   0x00000000005437c8 <arith_driver+712>:	48 0f af ef	imul   %rdi,%rbp
=> 0x00000000005437cc <arith_driver+716>:	e9 d7 fd ff ff	jmpq   0x5435a8 <arith_driver+168>
   0x00000000005437d1 <arith_driver+721>:	0f 1f 80 00 00 00 00	nopl   0x0(%rax)
(gdb) Line 2645 of "../../emacs-24.5/src/data.c" starts at address 0x5437c8 <arith_driver+712>
   and ends at 0x5437d8 <arith_driver+728>.
(gdb) rax            0x200000	2097152
rbx            0x1	1
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437cc	0x5437cc <arith_driver+716>
eflags         0x286	[ PF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2602	  for (argnum = 0; argnum < nargs; argnum++)
=> 0x00000000005435a8 <arith_driver+168>:	48 83 c3 01	add    $0x1,%rbx
   0x00000000005435ac <arith_driver+172>:	49 39 dd	cmp    %rbx,%r13
   0x00000000005435af <arith_driver+175>:	0f 84 f6 00 00 00	je     0x5436ab <arith_driver+427>
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0x200000	2097152
rbx            0x1	1
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435a8	0x5435a8 <arith_driver+168>
eflags         0x286	[ PF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435ac	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x00000000005435a8 <arith_driver+168>:	48 83 c3 01	add    $0x1,%rbx
=> 0x00000000005435ac <arith_driver+172>:	49 39 dd	cmp    %rbx,%r13
   0x00000000005435af <arith_driver+175>:	0f 84 f6 00 00 00	je     0x5436ab <arith_driver+427>
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0x200000	2097152
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435ac	0x5435ac <arith_driver+172>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435af	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x00000000005435a8 <arith_driver+168>:	48 83 c3 01	add    $0x1,%rbx
   0x00000000005435ac <arith_driver+172>:	49 39 dd	cmp    %rbx,%r13
=> 0x00000000005435af <arith_driver+175>:	0f 84 f6 00 00 00	je     0x5436ab <arith_driver+427>
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0x200000	2097152
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435af	0x5435af <arith_driver+175>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2611	      val = args[argnum];
=> 0x00000000005435b5 <arith_driver+181>:	49 8b 3c df	mov    (%r15,%rbx,8),%rdi
   0x00000000005435b9 <arith_driver+185>:	84 c9	test   %cl,%cl
   0x00000000005435bb <arith_driver+187>:	4c 0f 44 dd	cmove  %rbp,%r11
   0x00000000005435bf <arith_driver+191>:	4c 0f 44 e3	cmove  %rbx,%r12
(gdb) Line 2611 of "../../emacs-24.5/src/data.c" starts at address 0x543541 <arith_driver+65>
   and ends at 0x543545 <arith_driver+69>.
(gdb) rax            0x200000	2097152
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0xfffffc0000400001	-4398042316799
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435b5	0x5435b5 <arith_driver+181>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435b9	2611	      val = args[argnum];
   0x00000000005435b5 <arith_driver+181>:	49 8b 3c df	mov    (%r15,%rbx,8),%rdi
=> 0x00000000005435b9 <arith_driver+185>:	84 c9	test   %cl,%cl
   0x00000000005435bb <arith_driver+187>:	4c 0f 44 dd	cmove  %rbp,%r11
   0x00000000005435bf <arith_driver+191>:	4c 0f 44 e3	cmove  %rbx,%r12
(gdb) Line 2611 of "../../emacs-24.5/src/data.c" starts at address 0x543541 <arith_driver+65>
   and ends at 0x543545 <arith_driver+69>.
(gdb) rax            0x200000	2097152
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435b9	0x5435b9 <arith_driver+185>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435bb	2611	      val = args[argnum];
   0x00000000005435b5 <arith_driver+181>:	49 8b 3c df	mov    (%r15,%rbx,8),%rdi
   0x00000000005435b9 <arith_driver+185>:	84 c9	test   %cl,%cl
=> 0x00000000005435bb <arith_driver+187>:	4c 0f 44 dd	cmove  %rbp,%r11
   0x00000000005435bf <arith_driver+191>:	4c 0f 44 e3	cmove  %rbx,%r12
(gdb) Line 2611 of "../../emacs-24.5/src/data.c" starts at address 0x543541 <arith_driver+65>
   and ends at 0x543545 <arith_driver+69>.
(gdb) rax            0x200000	2097152
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0x1b55	6997
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435bb	0x5435bb <arith_driver+187>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435bf	2611	      val = args[argnum];
   0x00000000005435b5 <arith_driver+181>:	49 8b 3c df	mov    (%r15,%rbx,8),%rdi
   0x00000000005435b9 <arith_driver+185>:	84 c9	test   %cl,%cl
   0x00000000005435bb <arith_driver+187>:	4c 0f 44 dd	cmove  %rbp,%r11
=> 0x00000000005435bf <arith_driver+191>:	4c 0f 44 e3	cmove  %rbx,%r12
(gdb) Line 2611 of "../../emacs-24.5/src/data.c" starts at address 0x543541 <arith_driver+65>
   and ends at 0x543545 <arith_driver+69>.
(gdb) rax            0x200000	2097152
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x1	1
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435bf	0x5435bf <arith_driver+191>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) XTYPE (a=716) at ../../emacs-24.5/src/lisp.h:703
703	LISP_MACRO_DEFUN (XTYPE, enum Lisp_Type, (Lisp_Object a), (a))
=> 0x00000000005435c3 <arith_driver+195>:	89 f8	mov    %edi,%eax
   0x00000000005435c5 <arith_driver+197>:	89 fe	mov    %edi,%esi
   0x00000000005435c7 <arith_driver+199>:	83 e0 07	and    $0x7,%eax
(gdb) Line 703 of "../../emacs-24.5/src/lisp.h" starts at address 0x541c80 <Farrayp>
   and ends at 0x541c85 <Farrayp+5>.
(gdb) rax            0x200000	2097152
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435c3	0x5435c3 <arith_driver+195>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435c5	703	LISP_MACRO_DEFUN (XTYPE, enum Lisp_Type, (Lisp_Object a), (a))
   0x00000000005435c3 <arith_driver+195>:	89 f8	mov    %edi,%eax
=> 0x00000000005435c5 <arith_driver+197>:	89 fe	mov    %edi,%esi
   0x00000000005435c7 <arith_driver+199>:	83 e0 07	and    $0x7,%eax
(gdb) Line 703 of "../../emacs-24.5/src/lisp.h" starts at address 0x541c80 <Farrayp>
   and ends at 0x541c85 <Farrayp+5>.
(gdb) rax            0x2cc	716
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x1000004	16777220
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435c5	0x5435c5 <arith_driver+197>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435c7	703	LISP_MACRO_DEFUN (XTYPE, enum Lisp_Type, (Lisp_Object a), (a))
   0x00000000005435c3 <arith_driver+195>:	89 f8	mov    %edi,%eax
   0x00000000005435c5 <arith_driver+197>:	89 fe	mov    %edi,%esi
=> 0x00000000005435c7 <arith_driver+199>:	83 e0 07	and    $0x7,%eax
(gdb) Line 703 of "../../emacs-24.5/src/lisp.h" starts at address 0x541c80 <Farrayp>
   and ends at 0x541c85 <Farrayp+5>.
(gdb) rax            0x2cc	716
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x2cc	716
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435c7	0x5435c7 <arith_driver+199>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) MARKERP (x=716) at ../../emacs-24.5/src/lisp.h:2384
2384	LISP_MACRO_DEFUN (MARKERP, bool, (Lisp_Object x), (x))
=> 0x00000000005435ca <arith_driver+202>:	83 f8 03	cmp    $0x3,%eax
   0x00000000005435cd <arith_driver+205>:	75 89	jne    0x543558 <arith_driver+88>
   0x00000000005435cf <arith_driver+207>:	66 81 7f fd ac 5e	cmpw   $0x5eac,-0x3(%rdi)
   0x00000000005435d5 <arith_driver+213>:	0f 84 95 01 00 00	je     0x543770 <arith_driver+624>
(gdb) Line 2384 of "../../emacs-24.5/src/lisp.h" starts at address 0x541d80 <Fmarkerp>
   and ends at 0x541d8a <Fmarkerp+10>.
(gdb) rax            0x4	4
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x2cc	716
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435ca	0x5435ca <arith_driver+202>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435cd	2384	LISP_MACRO_DEFUN (MARKERP, bool, (Lisp_Object x), (x))
   0x00000000005435ca <arith_driver+202>:	83 f8 03	cmp    $0x3,%eax
=> 0x00000000005435cd <arith_driver+205>:	75 89	jne    0x543558 <arith_driver+88>
   0x00000000005435cf <arith_driver+207>:	66 81 7f fd ac 5e	cmpw   $0x5eac,-0x3(%rdi)
   0x00000000005435d5 <arith_driver+213>:	0f 84 95 01 00 00	je     0x543770 <arith_driver+624>
(gdb) Line 2384 of "../../emacs-24.5/src/lisp.h" starts at address 0x541d80 <Fmarkerp>
   and ends at 0x541d8a <Fmarkerp+10>.
(gdb) rax            0x4	4
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x2cc	716
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435cd	0x5435cd <arith_driver+205>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) arith_driver (code=Amult, nargs=3, args=0x7fffffffd820) at ../../emacs-24.5/src/data.c:2612
2612	      CHECK_NUMBER_OR_FLOAT_COERCE_MARKER (val);
=> 0x0000000000543558 <arith_driver+88>:	40 f6 c7 03	test   $0x3,%dil
   0x000000000054355c <arith_driver+92>:	48 8b 15 35 4b 63 00	mov    0x634b35(%rip),%rdx        # 0xb78098 <Qnumber_or_marker_p>
   0x0000000000543563 <arith_driver+99>:	74 09	je     0x54356e <arith_driver+110>
   0x0000000000543565 <arith_driver+101>:	83 f8 07	cmp    $0x7,%eax
   0x0000000000543568 <arith_driver+104>:	0f 85 82 00 00 00	jne    0x5435f0 <arith_driver+240>
(gdb) Line 2612 of "../../emacs-24.5/src/data.c" starts at address 0x543558 <arith_driver+88>
   and ends at 0x54356e <arith_driver+110>.
(gdb) rax            0x4	4
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x2cc	716
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543558	0x543558 <arith_driver+88>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054355c	2612	      CHECK_NUMBER_OR_FLOAT_COERCE_MARKER (val);
   0x0000000000543558 <arith_driver+88>:	40 f6 c7 03	test   $0x3,%dil
=> 0x000000000054355c <arith_driver+92>:	48 8b 15 35 4b 63 00	mov    0x634b35(%rip),%rdx        # 0xb78098 <Qnumber_or_marker_p>
   0x0000000000543563 <arith_driver+99>:	74 09	je     0x54356e <arith_driver+110>
   0x0000000000543565 <arith_driver+101>:	83 f8 07	cmp    $0x7,%eax
   0x0000000000543568 <arith_driver+104>:	0f 85 82 00 00 00	jne    0x5435f0 <arith_driver+240>
(gdb) Line 2612 of "../../emacs-24.5/src/data.c" starts at address 0x543558 <arith_driver+88>
   and ends at 0x54356e <arith_driver+110>.
(gdb) rax            0x4	4
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffff5ffffe	-10485762
rsi            0x2cc	716
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54355c	0x54355c <arith_driver+92>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543563	2612	      CHECK_NUMBER_OR_FLOAT_COERCE_MARKER (val);
   0x0000000000543558 <arith_driver+88>:	40 f6 c7 03	test   $0x3,%dil
   0x000000000054355c <arith_driver+92>:	48 8b 15 35 4b 63 00	mov    0x634b35(%rip),%rdx        # 0xb78098 <Qnumber_or_marker_p>
=> 0x0000000000543563 <arith_driver+99>:	74 09	je     0x54356e <arith_driver+110>
   0x0000000000543565 <arith_driver+101>:	83 f8 07	cmp    $0x7,%eax
   0x0000000000543568 <arith_driver+104>:	0f 85 82 00 00 00	jne    0x5435f0 <arith_driver+240>
(gdb) Line 2612 of "../../emacs-24.5/src/data.c" starts at address 0x543558 <arith_driver+88>
   and ends at 0x54356e <arith_driver+110>.
(gdb) rax            0x4	4
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543563	0x543563 <arith_driver+99>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2614	      if (FLOATP (val))
=> 0x000000000054356e <arith_driver+110>:	83 f8 07	cmp    $0x7,%eax
   0x0000000000543571 <arith_driver+113>:	0f 84 25 02 00 00	je     0x54379c <arith_driver+668>
(gdb) Line 2614 of "../../emacs-24.5/src/data.c" starts at address 0x54356e <arith_driver+110>
   and ends at 0x543577 <arith_driver+119>.
(gdb) rax            0x4	4
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54356e	0x54356e <arith_driver+110>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543571	2614	      if (FLOATP (val))
   0x000000000054356e <arith_driver+110>:	83 f8 07	cmp    $0x7,%eax
=> 0x0000000000543571 <arith_driver+113>:	0f 84 25 02 00 00	je     0x54379c <arith_driver+668>
(gdb) Line 2614 of "../../emacs-24.5/src/data.c" starts at address 0x54356e <arith_driver+110>
   and ends at 0x543577 <arith_driver+119>.
(gdb) rax            0x4	4
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543571	0x543571 <arith_driver+113>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2617	      args[argnum] = val;
=> 0x0000000000543577 <arith_driver+119>:	49 89 3c df	mov    %rdi,(%r15,%rbx,8)
(gdb) Line 2617 of "../../emacs-24.5/src/data.c" starts at address 0x543577 <arith_driver+119>
   and ends at 0x54357b <arith_driver+123>.
(gdb) rax            0x4	4
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543577	0x543577 <arith_driver+119>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) XINT (a=716) at ../../emacs-24.5/src/lisp.h:701
701	LISP_MACRO_DEFUN (XINT, EMACS_INT, (Lisp_Object a), (a))
=> 0x000000000054357b <arith_driver+123>:	48 c1 ff 02	sar    $0x2,%rdi
(gdb) Line 701 of "../../emacs-24.5/src/lisp.h" starts at address 0x542417 <Fash+23>
   and ends at 0x54241a <Fash+26>.
(gdb) rax            0x4	4
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0x2cc	716
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54357b	0x54357b <arith_driver+123>
eflags         0x293	[ CF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) arith_driver (code=Amult, nargs=3, args=0x7fffffffd820) at ../../emacs-24.5/src/data.c:2619
2619	      switch (code)
=> 0x000000000054357f <arith_driver+127>:	41 83 fe 08	cmp    $0x8,%r14d
   0x0000000000543583 <arith_driver+131>:	77 23	ja     0x5435a8 <arith_driver+168>
   0x0000000000543585 <arith_driver+133>:	44 89 f0	mov    %r14d,%eax
   0x0000000000543588 <arith_driver+136>:	ff 24 c5 a0 c2 5e 00	jmpq   *0x5ec2a0(,%rax,8)
   0x000000000054358f <arith_driver+143>:	90	nop
(gdb) Line 2619 of "../../emacs-24.5/src/data.c" starts at address 0x54357f <arith_driver+127>
   and ends at 0x543590 <arith_driver+144>.
(gdb) rax            0x4	4
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54357f	0x54357f <arith_driver+127>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543583	2619	      switch (code)
   0x000000000054357f <arith_driver+127>:	41 83 fe 08	cmp    $0x8,%r14d
=> 0x0000000000543583 <arith_driver+131>:	77 23	ja     0x5435a8 <arith_driver+168>
   0x0000000000543585 <arith_driver+133>:	44 89 f0	mov    %r14d,%eax
   0x0000000000543588 <arith_driver+136>:	ff 24 c5 a0 c2 5e 00	jmpq   *0x5ec2a0(,%rax,8)
   0x000000000054358f <arith_driver+143>:	90	nop
(gdb) Line 2619 of "../../emacs-24.5/src/data.c" starts at address 0x54357f <arith_driver+127>
   and ends at 0x543590 <arith_driver+144>.
(gdb) rax            0x4	4
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543583	0x543583 <arith_driver+131>
eflags         0x297	[ CF PF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543585	2619	      switch (code)
   0x000000000054357f <arith_driver+127>:	41 83 fe 08	cmp    $0x8,%r14d
   0x0000000000543583 <arith_driver+131>:	77 23	ja     0x5435a8 <arith_driver+168>
=> 0x0000000000543585 <arith_driver+133>:	44 89 f0	mov    %r14d,%eax
   0x0000000000543588 <arith_driver+136>:	ff 24 c5 a0 c2 5e 00	jmpq   *0x5ec2a0(,%rax,8)
   0x000000000054358f <arith_driver+143>:	90	nop
(gdb) Line 2619 of "../../emacs-24.5/src/data.c" starts at address 0x54357f <arith_driver+127>
   and ends at 0x543590 <arith_driver+144>.
(gdb) rax            0x4	4
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543585	0x543585 <arith_driver+133>
eflags         0x297	[ CF PF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543588	2619	      switch (code)
   0x000000000054357f <arith_driver+127>:	41 83 fe 08	cmp    $0x8,%r14d
   0x0000000000543583 <arith_driver+131>:	77 23	ja     0x5435a8 <arith_driver+168>
   0x0000000000543585 <arith_driver+133>:	44 89 f0	mov    %r14d,%eax
=> 0x0000000000543588 <arith_driver+136>:	ff 24 c5 a0 c2 5e 00	jmpq   *0x5ec2a0(,%rax,8)
   0x000000000054358f <arith_driver+143>:	90	nop
(gdb) Line 2619 of "../../emacs-24.5/src/data.c" starts at address 0x54357f <arith_driver+127>
   and ends at 0x543590 <arith_driver+144>.
(gdb) rax            0x2	2
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543588	0x543588 <arith_driver+136>
eflags         0x297	[ CF PF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
=> 0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543600	0x543600 <arith_driver+256>
eflags         0x297	[ CF PF AF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543603	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
=> 0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543603	0x543603 <arith_driver+259>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543609	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
=> 0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543609	0x543609 <arith_driver+265>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054360f	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
=> 0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54360f	0x54360f <arith_driver+271>
eflags         0x202	[ IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543612	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
=> 0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543612	0x543612 <arith_driver+274>
eflags         0x286	[ PF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
=> 0x0000000000543838 <arith_driver+824>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x0000000000543842 <arith_driver+834>:	48 99	cqto
   0x0000000000543844 <arith_driver+836>:	48 f7 ff	idiv   %rdi
   0x0000000000543847 <arith_driver+839>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054384a <arith_driver+842>:	0f 9f c0	setg   %al
   0x000000000054384d <arith_driver+845>:	e9 db fd ff ff	jmpq   0x54362d <arith_driver+301>
   0x0000000000543852 <arith_driver+850>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x000000000054385c <arith_driver+860>:	48 99	cqto
   0x000000000054385e <arith_driver+862>:	48 f7 ff	idiv   %rdi
   0x0000000000543861 <arith_driver+865>:	48 39 e8	cmp    %rbp,%rax
   0x0000000000543864 <arith_driver+868>:	0f 9f c0	setg   %al
   0x0000000000543867 <arith_driver+871>:	e9 c1 fd ff ff	jmpq   0x54362d <arith_driver+301>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x2	2
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543838	0x543838 <arith_driver+824>
eflags         0x286	[ PF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543842	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543838 <arith_driver+824>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
=> 0x0000000000543842 <arith_driver+834>:	48 99	cqto
   0x0000000000543844 <arith_driver+836>:	48 f7 ff	idiv   %rdi
   0x0000000000543847 <arith_driver+839>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054384a <arith_driver+842>:	0f 9f c0	setg   %al
   0x000000000054384d <arith_driver+845>:	e9 db fd ff ff	jmpq   0x54362d <arith_driver+301>
   0x0000000000543852 <arith_driver+850>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x000000000054385c <arith_driver+860>:	48 99	cqto
   0x000000000054385e <arith_driver+862>:	48 f7 ff	idiv   %rdi
   0x0000000000543861 <arith_driver+865>:	48 39 e8	cmp    %rbp,%rax
   0x0000000000543864 <arith_driver+868>:	0f 9f c0	setg   %al
   0x0000000000543867 <arith_driver+871>:	e9 c1 fd ff ff	jmpq   0x54362d <arith_driver+301>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x8000000000000000	-9223372036854775808
rbx            0x2	2
rcx            0x0	0
rdx            0xbb8902	12290306
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543842	0x543842 <arith_driver+834>
eflags         0x286	[ PF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543844	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543838 <arith_driver+824>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x0000000000543842 <arith_driver+834>:	48 99	cqto
=> 0x0000000000543844 <arith_driver+836>:	48 f7 ff	idiv   %rdi
   0x0000000000543847 <arith_driver+839>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054384a <arith_driver+842>:	0f 9f c0	setg   %al
   0x000000000054384d <arith_driver+845>:	e9 db fd ff ff	jmpq   0x54362d <arith_driver+301>
   0x0000000000543852 <arith_driver+850>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x000000000054385c <arith_driver+860>:	48 99	cqto
   0x000000000054385e <arith_driver+862>:	48 f7 ff	idiv   %rdi
   0x0000000000543861 <arith_driver+865>:	48 39 e8	cmp    %rbp,%rax
   0x0000000000543864 <arith_driver+868>:	0f 9f c0	setg   %al
   0x0000000000543867 <arith_driver+871>:	e9 c1 fd ff ff	jmpq   0x54362d <arith_driver+301>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0x8000000000000000	-9223372036854775808
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffffffffff	-1
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543844	0x543844 <arith_driver+836>
eflags         0x286	[ PF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x0000000000543847	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543838 <arith_driver+824>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x0000000000543842 <arith_driver+834>:	48 99	cqto
   0x0000000000543844 <arith_driver+836>:	48 f7 ff	idiv   %rdi
=> 0x0000000000543847 <arith_driver+839>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054384a <arith_driver+842>:	0f 9f c0	setg   %al
   0x000000000054384d <arith_driver+845>:	e9 db fd ff ff	jmpq   0x54362d <arith_driver+301>
   0x0000000000543852 <arith_driver+850>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x000000000054385c <arith_driver+860>:	48 99	cqto
   0x000000000054385e <arith_driver+862>:	48 f7 ff	idiv   %rdi
   0x0000000000543861 <arith_driver+865>:	48 39 e8	cmp    %rbp,%rax
   0x0000000000543864 <arith_driver+868>:	0f 9f c0	setg   %al
   0x0000000000543867 <arith_driver+871>:	e9 c1 fd ff ff	jmpq   0x54362d <arith_driver+301>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0xff48f044a5e641ca	-51527218082987574
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x543847	0x543847 <arith_driver+839>
eflags         0x286	[ PF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054384a	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543838 <arith_driver+824>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x0000000000543842 <arith_driver+834>:	48 99	cqto
   0x0000000000543844 <arith_driver+836>:	48 f7 ff	idiv   %rdi
   0x0000000000543847 <arith_driver+839>:	48 39 e8	cmp    %rbp,%rax
=> 0x000000000054384a <arith_driver+842>:	0f 9f c0	setg   %al
   0x000000000054384d <arith_driver+845>:	e9 db fd ff ff	jmpq   0x54362d <arith_driver+301>
   0x0000000000543852 <arith_driver+850>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x000000000054385c <arith_driver+860>:	48 99	cqto
   0x000000000054385e <arith_driver+862>:	48 f7 ff	idiv   %rdi
   0x0000000000543861 <arith_driver+865>:	48 39 e8	cmp    %rbp,%rax
   0x0000000000543864 <arith_driver+868>:	0f 9f c0	setg   %al
   0x0000000000543867 <arith_driver+871>:	e9 c1 fd ff ff	jmpq   0x54362d <arith_driver+301>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0xff48f044a5e641ca	-51527218082987574
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54384a	0x54384a <arith_driver+842>
eflags         0x283	[ CF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054384d	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543838 <arith_driver+824>:	48 b8 00 00 00 00 00 00 00 80	movabs $0x8000000000000000,%rax
   0x0000000000543842 <arith_driver+834>:	48 99	cqto
   0x0000000000543844 <arith_driver+836>:	48 f7 ff	idiv   %rdi
   0x0000000000543847 <arith_driver+839>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054384a <arith_driver+842>:	0f 9f c0	setg   %al
=> 0x000000000054384d <arith_driver+845>:	e9 db fd ff ff	jmpq   0x54362d <arith_driver+301>
   0x0000000000543852 <arith_driver+850>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x000000000054385c <arith_driver+860>:	48 99	cqto
   0x000000000054385e <arith_driver+862>:	48 f7 ff	idiv   %rdi
   0x0000000000543861 <arith_driver+865>:	48 39 e8	cmp    %rbp,%rax
   0x0000000000543864 <arith_driver+868>:	0f 9f c0	setg   %al
   0x0000000000543867 <arith_driver+871>:	e9 c1 fd ff ff	jmpq   0x54362d <arith_driver+301>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0xff48f044a5e64100	-51527218082987776
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54384d	0x54384d <arith_driver+845>
eflags         0x283	[ CF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054362d	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
=> 0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
   0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0xff48f044a5e64100	-51527218082987776
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54362d	0x54362d <arith_driver+301>
eflags         0x283	[ CF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x000000000054362f	2638		  if (INT_MULTIPLY_OVERFLOW (accum, next))
   0x0000000000543600 <arith_driver+256>:	48 85 ff	test   %rdi,%rdi
   0x0000000000543603 <arith_driver+259>:	0f 88 cf 01 00 00	js     0x5437d8 <arith_driver+728>
   0x0000000000543609 <arith_driver+265>:	0f 84 b9 01 00 00	je     0x5437c8 <arith_driver+712>
   0x000000000054360f <arith_driver+271>:	48 85 ed	test   %rbp,%rbp
   0x0000000000543612 <arith_driver+274>:	0f 88 20 02 00 00	js     0x543838 <arith_driver+824>
   0x0000000000543618 <arith_driver+280>:	48 b8 ff ff ff ff ff ff ff 7f	movabs $0x7fffffffffffffff,%rax
   0x0000000000543622 <arith_driver+290>:	48 99	cqto
   0x0000000000543624 <arith_driver+292>:	48 f7 ff	idiv   %rdi
   0x0000000000543627 <arith_driver+295>:	48 39 e8	cmp    %rbp,%rax
   0x000000000054362a <arith_driver+298>:	0f 9c c0	setl   %al
   0x000000000054362d <arith_driver+301>:	84 c0	test   %al,%al
=> 0x000000000054362f <arith_driver+303>:	0f 84 93 01 00 00	je     0x5437c8 <arith_driver+712>
(gdb) Line 2638 of "../../emacs-24.5/src/data.c" starts at address 0x543600 <arith_driver+256>
   and ends at 0x543635 <arith_driver+309>.
(gdb) rax            0xff48f044a5e64100	-51527218082987776
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x54362f	0x54362f <arith_driver+303>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2645		    accum *= next;
=> 0x00000000005437c8 <arith_driver+712>:	48 0f af ef	imul   %rdi,%rbp
   0x00000000005437cc <arith_driver+716>:	e9 d7 fd ff ff	jmpq   0x5435a8 <arith_driver+168>
   0x00000000005437d1 <arith_driver+721>:	0f 1f 80 00 00 00 00	nopl   0x0(%rax)
(gdb) Line 2645 of "../../emacs-24.5/src/data.c" starts at address 0x5437c8 <arith_driver+712>
   and ends at 0x5437d8 <arith_driver+728>.
(gdb) rax            0xff48f044a5e64100	-51527218082987776
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xff92ac06d5401b55	0xff92ac06d5401b55
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437c8	0x5437c8 <arith_driver+712>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005437cc	2645		    accum *= next;
   0x00000000005437c8 <arith_driver+712>:	48 0f af ef	imul   %rdi,%rbp
=> 0x00000000005437cc <arith_driver+716>:	e9 d7 fd ff ff	jmpq   0x5435a8 <arith_driver+168>
   0x00000000005437d1 <arith_driver+721>:	0f 1f 80 00 00 00 00	nopl   0x0(%rax)
(gdb) Line 2645 of "../../emacs-24.5/src/data.c" starts at address 0x5437c8 <arith_driver+712>
   and ends at 0x5437d8 <arith_driver+728>.
(gdb) rax            0xff48f044a5e64100	-51527218082987776
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xb38e48c71bd31c6f	0xb38e48c71bd31c6f
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5437cc	0x5437cc <arith_driver+716>
eflags         0x286	[ PF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2602	  for (argnum = 0; argnum < nargs; argnum++)
=> 0x00000000005435a8 <arith_driver+168>:	48 83 c3 01	add    $0x1,%rbx
   0x00000000005435ac <arith_driver+172>:	49 39 dd	cmp    %rbx,%r13
   0x00000000005435af <arith_driver+175>:	0f 84 f6 00 00 00	je     0x5436ab <arith_driver+427>
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0xff48f044a5e64100	-51527218082987776
rbx            0x2	2
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xb38e48c71bd31c6f	0xb38e48c71bd31c6f
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435a8	0x5435a8 <arith_driver+168>
eflags         0x286	[ PF SF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435ac	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x00000000005435a8 <arith_driver+168>:	48 83 c3 01	add    $0x1,%rbx
=> 0x00000000005435ac <arith_driver+172>:	49 39 dd	cmp    %rbx,%r13
   0x00000000005435af <arith_driver+175>:	0f 84 f6 00 00 00	je     0x5436ab <arith_driver+427>
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0xff48f044a5e64100	-51527218082987776
rbx            0x3	3
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xb38e48c71bd31c6f	0xb38e48c71bd31c6f
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435ac	0x5435ac <arith_driver+172>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005435af	2602	  for (argnum = 0; argnum < nargs; argnum++)
   0x00000000005435a8 <arith_driver+168>:	48 83 c3 01	add    $0x1,%rbx
   0x00000000005435ac <arith_driver+172>:	49 39 dd	cmp    %rbx,%r13
=> 0x00000000005435af <arith_driver+175>:	0f 84 f6 00 00 00	je     0x5436ab <arith_driver+427>
(gdb) Line 2602 of "../../emacs-24.5/src/data.c" starts at address 0x543525 <arith_driver+37>
   and ends at 0x543541 <arith_driver+65>.
(gdb) rax            0xff48f044a5e64100	-51527218082987776
rbx            0x3	3
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xb38e48c71bd31c6f	0xb38e48c71bd31c6f
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5435af	0x5435af <arith_driver+175>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 2679	}
=> 0x00000000005436ab <arith_driver+427>:	48 83 c4 18	add    $0x18,%rsp
(gdb) Line 2679 of "../../emacs-24.5/src/data.c" starts at address 0x5436ab <arith_driver+427>
   and ends at 0x5436af <arith_driver+431>.
(gdb) rax            0xff48f044a5e64100	-51527218082987776
rbx            0x3	3
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xb38e48c71bd31c6f	0xb38e48c71bd31c6f
rsp            0x7fffffffd7d0	0x7fffffffd7d0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5436ab	0x5436ab <arith_driver+427>
eflags         0x246	[ PF ZF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) make_number (n=-5508385274225025937) at ../../emacs-24.5/src/lisp.h:700
700	LISP_MACRO_DEFUN (make_number, Lisp_Object, (EMACS_INT n), (n))
=> 0x00000000005436af <arith_driver+431>:	48 8d 04 ad 00 00 00 00	lea    0x0(,%rbp,4),%rax
(gdb) Line 700 of "../../emacs-24.5/src/lisp.h" starts at address 0x417e28 <wrong_length_argument+1>
   and ends at 0x417e2c <wrong_length_argument+5>.
(gdb) rax            0xff48f044a5e64100	-51527218082987776
rbx            0x3	3
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xb38e48c71bd31c6f	0xb38e48c71bd31c6f
rsp            0x7fffffffd7e8	0x7fffffffd7e8
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5436af	0x5436af <arith_driver+431>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) arith_driver (code=<optimized out>, nargs=<optimized out>, args=<optimized out>)
    at ../../emacs-24.5/src/data.c:2679
2679	}
=> 0x00000000005436b7 <arith_driver+439>:	5b	pop    %rbx
   0x00000000005436b8 <arith_driver+440>:	5d	pop    %rbp
   0x00000000005436b9 <arith_driver+441>:	41 5c	pop    %r12
   0x00000000005436bb <arith_driver+443>:	41 5d	pop    %r13
   0x00000000005436bd <arith_driver+445>:	41 5e	pop    %r14
   0x00000000005436bf <arith_driver+447>:	41 5f	pop    %r15
   0x00000000005436c1 <arith_driver+449>:	c3	retq
   0x00000000005436c2 <arith_driver+450>:	66 0f 1f 44 00 00	nopw   0x0(%rax,%rax,1)
(gdb) Line 2679 of "../../emacs-24.5/src/data.c" starts at address 0x5436ab <arith_driver+427>
   and ends at 0x5436af <arith_driver+431>.
(gdb) rax            0xce39231c6f4c71bc	-3586797023190552132
rbx            0x3	3
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xb38e48c71bd31c6f	0xb38e48c71bd31c6f
rsp            0x7fffffffd7e8	0x7fffffffd7e8
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5436b7	0x5436b7 <arith_driver+439>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005436b8	2679	}
   0x00000000005436b7 <arith_driver+439>:	5b	pop    %rbx
=> 0x00000000005436b8 <arith_driver+440>:	5d	pop    %rbp
   0x00000000005436b9 <arith_driver+441>:	41 5c	pop    %r12
   0x00000000005436bb <arith_driver+443>:	41 5d	pop    %r13
   0x00000000005436bd <arith_driver+445>:	41 5e	pop    %r14
   0x00000000005436bf <arith_driver+447>:	41 5f	pop    %r15
   0x00000000005436c1 <arith_driver+449>:	c3	retq
   0x00000000005436c2 <arith_driver+450>:	66 0f 1f 44 00 00	nopw   0x0(%rax,%rax,1)
(gdb) Line 2679 of "../../emacs-24.5/src/data.c" starts at address 0x5436ab <arith_driver+427>
   and ends at 0x5436af <arith_driver+431>.
(gdb) rax            0xce39231c6f4c71bc	-3586797023190552132
rbx            0x7fffffffd838	140737488345144
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0xb38e48c71bd31c6f	0xb38e48c71bd31c6f
rsp            0x7fffffffd7f0	0x7fffffffd7f0
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5436b8	0x5436b8 <arith_driver+440>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005436b9	2679	}
   0x00000000005436b7 <arith_driver+439>:	5b	pop    %rbx
   0x00000000005436b8 <arith_driver+440>:	5d	pop    %rbp
=> 0x00000000005436b9 <arith_driver+441>:	41 5c	pop    %r12
   0x00000000005436bb <arith_driver+443>:	41 5d	pop    %r13
   0x00000000005436bd <arith_driver+445>:	41 5e	pop    %r14
   0x00000000005436bf <arith_driver+447>:	41 5f	pop    %r15
   0x00000000005436c1 <arith_driver+449>:	c3	retq
   0x00000000005436c2 <arith_driver+450>:	66 0f 1f 44 00 00	nopw   0x0(%rax,%rax,1)
(gdb) Line 2679 of "../../emacs-24.5/src/data.c" starts at address 0x5436ab <arith_driver+427>
   and ends at 0x5436af <arith_driver+431>.
(gdb) rax            0xce39231c6f4c71bc	-3586797023190552132
rbx            0x7fffffffd838	140737488345144
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd7f8	0x7fffffffd7f8
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0x2	2
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5436b9	0x5436b9 <arith_driver+441>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005436bb	2679	}
   0x00000000005436b7 <arith_driver+439>:	5b	pop    %rbx
   0x00000000005436b8 <arith_driver+440>:	5d	pop    %rbp
   0x00000000005436b9 <arith_driver+441>:	41 5c	pop    %r12
=> 0x00000000005436bb <arith_driver+443>:	41 5d	pop    %r13
   0x00000000005436bd <arith_driver+445>:	41 5e	pop    %r14
   0x00000000005436bf <arith_driver+447>:	41 5f	pop    %r15
   0x00000000005436c1 <arith_driver+449>:	c3	retq
   0x00000000005436c2 <arith_driver+450>:	66 0f 1f 44 00 00	nopw   0x0(%rax,%rax,1)
(gdb) Line 2679 of "../../emacs-24.5/src/data.c" starts at address 0x5436ab <arith_driver+427>
   and ends at 0x5436af <arith_driver+431>.
(gdb) rax            0xce39231c6f4c71bc	-3586797023190552132
rbx            0x7fffffffd838	140737488345144
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd800	0x7fffffffd800
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0xafa950	11512144
r13            0x3	3
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5436bb	0x5436bb <arith_driver+443>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005436bd	2679	}
   0x00000000005436b7 <arith_driver+439>:	5b	pop    %rbx
   0x00000000005436b8 <arith_driver+440>:	5d	pop    %rbp
   0x00000000005436b9 <arith_driver+441>:	41 5c	pop    %r12
   0x00000000005436bb <arith_driver+443>:	41 5d	pop    %r13
=> 0x00000000005436bd <arith_driver+445>:	41 5e	pop    %r14
   0x00000000005436bf <arith_driver+447>:	41 5f	pop    %r15
   0x00000000005436c1 <arith_driver+449>:	c3	retq
   0x00000000005436c2 <arith_driver+450>:	66 0f 1f 44 00 00	nopw   0x0(%rax,%rax,1)
(gdb) Line 2679 of "../../emacs-24.5/src/data.c" starts at address 0x5436ab <arith_driver+427>
   and ends at 0x5436af <arith_driver+431>.
(gdb) rax            0xce39231c6f4c71bc	-3586797023190552132
rbx            0x7fffffffd838	140737488345144
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd808	0x7fffffffd808
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0xafa950	11512144
r13            0x180	384
r14            0x2	2
r15            0x7fffffffd820	140737488345120
rip            0x5436bd	0x5436bd <arith_driver+445>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005436bf	2679	}
   0x00000000005436b7 <arith_driver+439>:	5b	pop    %rbx
   0x00000000005436b8 <arith_driver+440>:	5d	pop    %rbp
   0x00000000005436b9 <arith_driver+441>:	41 5c	pop    %r12
   0x00000000005436bb <arith_driver+443>:	41 5d	pop    %r13
   0x00000000005436bd <arith_driver+445>:	41 5e	pop    %r14
=> 0x00000000005436bf <arith_driver+447>:	41 5f	pop    %r15
   0x00000000005436c1 <arith_driver+449>:	c3	retq
   0x00000000005436c2 <arith_driver+450>:	66 0f 1f 44 00 00	nopw   0x0(%rax,%rax,1)
(gdb) Line 2679 of "../../emacs-24.5/src/data.c" starts at address 0x5436ab <arith_driver+427>
   and ends at 0x5436af <arith_driver+431>.
(gdb) rax            0xce39231c6f4c71bc	-3586797023190552132
rbx            0x7fffffffd838	140737488345144
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd810	0x7fffffffd810
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0x7fffffffd820	140737488345120
rip            0x5436bf	0x5436bf <arith_driver+447>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
(gdb) 0x00000000005436c1 in arith_driver (code=<optimized out>, nargs=<optimized out>,
    args=<optimized out>) at ../../emacs-24.5/src/data.c:2679
2679	}
   0x00000000005436b7 <arith_driver+439>:	5b	pop    %rbx
   0x00000000005436b8 <arith_driver+440>:	5d	pop    %rbp
   0x00000000005436b9 <arith_driver+441>:	41 5c	pop    %r12
   0x00000000005436bb <arith_driver+443>:	41 5d	pop    %r13
   0x00000000005436bd <arith_driver+445>:	41 5e	pop    %r14
   0x00000000005436bf <arith_driver+447>:	41 5f	pop    %r15
=> 0x00000000005436c1 <arith_driver+449>:	c3	retq
   0x00000000005436c2 <arith_driver+450>:	66 0f 1f 44 00 00	nopw   0x0(%rax,%rax,1)
(gdb) Line 2679 of "../../emacs-24.5/src/data.c" starts at address 0x5436ab <arith_driver+427>
   and ends at 0x5436af <arith_driver+431>.
(gdb) rax            0xce39231c6f4c71bc	-3586797023190552132
rbx            0x7fffffffd838	140737488345144
rcx            0x0	0
rdx            0xffffffffffffffc2	-62
rsi            0x2cc	716
rdi            0xb3	179
rbp            0x7fffffffd8f0	0x7fffffffd8f0
rsp            0x7fffffffd818	0x7fffffffd818
r8             0x2	2
r9             0x7fffffffd9d0	140737488345552
r10            0x0	0
r11            0xff92ac06d5401b55	-30773102090642603
r12            0xafa950	11512144
r13            0x180	384
r14            0x7fffffffd820	140737488345120
r15            0xbab772	12236658
rip            0x5436c1	0x5436c1 <arith_driver+449>
eflags         0x206	[ PF IF ]
cs             0x33	51
ss             0x2b	43
ds             0x0	0
es             0x0	0
fs             0x0	0
gs             0x0	0
